{"SpawnTemplate.udk": {"title": "Golf v0.2", "author": "Hurricane", "description": "Bringing Golf to Rocket League!\nPress \"rest-ball\" to start!\n**If you have texture bugs such as whit/blue patterned textures or grey sky download this and follow the instructions there:**\nWorkshop map texture packages download: <https://rocketleaguemods.com/mods/workshop-textures/>\n[rocketleaguemods.com]\n**v0.2 released:**\n Discover a complete redesigned map with 5 holes, new lights and a few textures!\nThis is my first map, so things may not work correctly or look terrible! Trying to improve this map asap!\n__RULES:__\n- try to get the ball into the hole with smallest amount of touches!\n- you are allowed to save the ball from dropping\nPlanned stuff:\n-fancy stuff\n-couple more holes to play\n-functional stuff", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1094177576"}, "beautiful.udk": {"title": "I made this for you!", "author": "JustSayBoot", "description": "Thats right I made this map for you, Enjoy <3!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1113776418"}, "Quadgoal.udk": {"title": "QuadGoal", "author": "Derzo", "description": "Recreation of Octagon, but with 4 goals.\nDISCLAIMER:\nThis is supposed to be played through LAN using Rocket Launcher, but the 4 goal mechanic isn't implemented in it yet.\n-When scored a goal, all teams get a point except the one that got scored on", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1121502881"}, "bouncycastle.udk": {"title": "Bouncy Castle Standalone v1.1.2", "author": "BatDuck", "description": "Are you tired of all those normal maps?\nNeed a break from those competitive rounds?\nOr do you just want some fun?\nWell worry no longer! Come on down to the ole bouncy castle now available in your Rocket League Workshop!\nWe have top-notch best-of-the-best completely hand made bouncing physics for you to relax on.\nFun for the whole family! Kids love it! Adults love it! Everybody loves it! Even bots love it!\nWe have bounciness and we have balls, lots of 'em. You can now spawn in more balls all for your own enjoyment at the low cost of $0.00!\n--------------------------------------------------------\nKnown Issues:\nYou can still pass through the castle but you get teleported out of it so bots can't get stuck.\nIf you're experiencing any issues with this map, please let me know in the comments, for I only want you to have the best possible experience with this map!\n~BatDuck", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1127376287"}, "MapContestTemplate.udk": {"title": "Map Template", "author": "Stanbroek", "description": "**This map template is a start for people who want to start making custom maps for Rocket League**\n**MapTemplate.udk**\n consist of 5 spawning points for each team and two goals.\n**Park_P.udk**\n (By \nDerzo: <https://www.steamcommunity.com/id/DerzoDev>\n) contains dummy items with reverences to the models and materials used in Beckwith Park.\nNote:\nIf you are just getting started with mapping there are a lot of guides and how to set up in the \nRocket League Mods discord: <https://discord.gg/NGe4gt9>\n[discord.gg]", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1184017171"}, "MechArena.udk": {"title": "Mech Arena: Zombie Survival", "author": "BatDuck", "description": "In this map you fight against hordes of bots inside of your very own mech. You can choose from varying difficulties and there's also a score system to see who can get the furthest! Now with controller support*!\n \nPresented to you by the creator of the Bouncy Castle map, Mech Arena: Zombie Survival is a map made for a mapping contest held by the Rocket League Mods community. For more information on the contest, \nclick here: <https://redd.it/78oh04>\n[redd.it]\nTo vote for this or a different map check out the \nRocket League Mods discord: <https://discord.gg/4s8WsFy>\n[discord.gg]\n**Vote here: <https://www.poll-maker.com/poll1939228xaB299188-51>**\n \nAny feedback is highly appreciated! You can also subscribe to \nthe discussion to be notified of new updates here: <http://steamcommunity.com/workshop/filedetails/discussion/1197248434/1483235412208296319/>\n*Not recommended because I can't map anything to the thumbsticks and it's weird\n \n~BatDuck\n ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1197248434"}, "KingsOfTheHills.udk": {"title": "Kings of the Hills v1.1", "author": "CoCo", "description": "*The map has been updated to 1.1 (see changes notes)*\nIn this soccar map you will have to defend your hill from your opponents.\nLook for the targets above the trees, they might be useful to you ;)\nThis map was created for the RLmods map contest.\nYou can play this map in LAN with friends.\nMore details: \n<https://rocketleaguemods.com/mods/rocket-launcher>\nI think this map could be really fun in a 3v3 setup. Haven't tried yet!\n I really advice everyone to try a lot of different playmodes on this map and would appreciate any feedback/recommandation in order to improve the map gameplay.\nSpecial thanks to Kirax for helping with some modelling and texturing!\nSupport him on: \n<https://www.artstation.com/thomastalarico>\nPlease make sure to download the workshop textures : \n<https://rocketleaguemods.com/mods/workshop-textures>\n in order to fully enjoy! \nHave fun!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1198198634"}, "BoosterRooster.udk": {"title": "[2-8 Players] Booster-Rooster", "author": "Derzo", "description": "An early version of my racing map for the RL mods mapping contest\nHow to play with friends!\n1. \nDownload Rocket Launcher: <https://www.reddit.com/r/RocketLeague/comments/7462cv/announcing_rocket_launcher_a_program_for_playing/>\n2. \nDownload and register to evolve 1.0: <https://www.evolvehq.com/welcome>\n[www.evolvehq.com]\n It's a bit easier than hamachi and direct IP connection IMO\n3. Create an evolve party and let your friends join it\n4.  \nDo this fix for evolve: <https://www.youtube.com/watch?v=V7il4PB2yuk>\n5. (Optional) Go to Evolve Preferences by clicking the big button on top left corner, go to features and disable everything else than Party System. Evolve can be pretty annoying if you don't do that\n6. Launch Rocket League\n7. Launch Rocket Launcher\n8. Go to Map Swapper tab in Rocket Launcher, hit Refresh and select BoosterRooster (everyone has to do this)\n9. Host a local lobby with the map set to underpass (Labs, not tokyo) and let your friends join that local lobby\nAlso note that if the host has downloaded any texture packages, everyone joining has to have them too. Otherwise you're going to get a package mismatch error when joining.\nRecommended Mutators\nMatch Length: Unlimited\nBoost Amount: Unlimited\nRumble: Destruction Derby\nDemolish: Friendly Fire", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1198375343"}, "Halfpipe.udk": {"title": "Half Pipe", "author": "Pastey", "description": "A map for freestyling sk8terbois and the modded multiplayer community.\nv2.5\n- Fixed an issue where the ball wouldn't spawn with the Disable Goal Reset mutator\n- The ball now spawns above ramps and drops on countdown. No more looking down at your car!\n- Want to check out the skate park with friends? The Free Roam Easter Egg is now available during multiplayer matches (previously available during Free Play only). Hint: check the top of the map.\nSee changelog for more details.\nThis map is meant to be played with 2-8 players. See \nRocket Launcher: <https://rocketleaguemods.com/mods/rocket-launcher>\n[rocketleaguemods.com]\n instructions for how to setup multiplayer.\nHow to play:\nPlayers start at the top. The ball starts at bottom of the ramp.\nLand the ball on the opposing team's deck to score.\nAt 0 seconds, the ball has to land at the bottom of the ramp for the game to end.\nThere are boost pads but the effects don't work properly. At the top above the ramps is an invisible area where you can collect 100 boost every two seconds. As long as you're up there, your boost gauge should continue to refill.\n**Mutator suggestions to make this gamemode easier:**\nLow Ball Bounciness\nRumble,\nRumble (spikes only),\nLow Gravity,\nMoonball,\nPinball\nIssues:\nBoostpad effects don't work properly.\nUpper boost area doesn't work properly if there's more than one player in it at a time\nCelebration sequence is bugged.\nPlease post a comment if you find other issues. Thanks!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1198632568"}, "AerialMap.udk": {"title": "Aerial Map", "author": "Frus", "description": "I'll polish the map in a later update.\n2017/12/01 - Added Textures.\n2017/12/03 - Scaled the map down, Added spawn points, & Improved shadows.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1212847139"}, "greenscreen_p.udk": {"title": "Green Screen Map (video editing tool)", "author": "CoCo", "description": "This map allows you to watch a replay with a green screen background.\n** How to use it:**\n__1st method (online replays):__\nLook for an online replay of your choice then replace the map file where your replay stands with the green screen map file. \nFor example, if the map is \"Beckwith Park (Midnight)\", rename the green screen map file to \"Park_Night_P.upk\" \n**/!\\ don't forget to backup the original map file and make sure you won't play online with the green screen map because it could cost you a temp ban /!\\**\n. \nOnce the map is replaced you can load your online replay and it will be green screened.\n__2nd method (offline replays):__\nReplace the map file of your choice with the green screen map. \nCreate a private match with a 1 goal score limit. Select the map that has been replaced, score a goal on the green screen map, save the replay then load the replay you just generated.\n**Link to the green screen map file:**\n   - \n*<https://www.dropbox.com/s/upx8402ba9hg39g/GreenScreenRL.zip?dl=0>*\nYou could also look for the map file in your steam workshop folder but this just makes it easier for you to get the file.\n**For a guided video of the above methods, you can check Zaphir's tutorials:**\n   - \n*english version: <https://youtu.be/W-bTDQefgjA>*\n or \n*french version: <https://youtu.be/XnyuYPsEAx8>*\nSpecial thanks to Derzo and Zaphir!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1246337892"}, "Saloms.udk": {"title": "Slaloms Practice", "author": "Greaus", "description": "This is an isolated version of level 11 from the parkour map #1 so that people can practice Aerial control without everything else. Credit for the map design goes to Dreale, all I did was remove everything else. I know I misspelled the word in the picture, but I'm too lazy to change it at the moment.\nThe Original map can be found here:\n<http://steamcommunity.com/sharedfiles/filedetails/?id=821751580>\nReccomended textures:\n<https://rocketleaguemods.com/mods/textures-for-maps/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1285257135"}, "RLRacingRoyale.udk": {"title": "[MP] RL Racing Royale - Alpha2.2", "author": "Karl-Heinz Schneider", "description": "Alpha 2 released! Check the Workshop description for Changelog and Update Instructions\n-----\n**RL Racing Royale**\n isn't just a single small Map, it is aiming to establish a \n**new Gamemode**\n into the Rocket Leauge universe: \n**Multiplayer Racing**\n - by mixing the best gameplay features from Rocket League and your favourite kart racing games!\nFeatures:\n \n Multiplayer Racing with support for up to 10 Players\n \n completely custom ingame Menu and HUD with custom Scoreboard, Minimap and more!\n \n for now featuring one single race track (rc_Lake) for public testing, but more tracks comming very soon\n \n racing framework easily extendable, so other devs can integrate new tracks without the need to code (other than very very few basic Kismet nodes)\nHow to Play:\n**PSA: The map itself is not really playable without two extra steps!**\n__Step 1:__\n \n**Problem:**\n The Framework uses Level Streaming to load in only the necessary files (-> only the active race track), but without (manual) changes RL will crash, because it cant find the track and its dependencies.\n \n**Solution:**\n\t\t[Copy track files into  ...\\*STEAM*\\SteamApps\\common\\rocketleague\\TAGame\\CookedPCConsole by hand (-> extra HDD space needed)]\n \n \n**OR**\n \n\t\t[create symbolic links in ...\\*STEAM*\\SteamApps\\common\\rocketleague\\TAGame\\CookedPCConsole to point to your workshop folder (where this mod will get dl'ed by steam: *STEAM*\\SteamApps\\workshop\\content\\252950\\1287922725)(-> no extra HDD space needed)]\n \n \n**OR**\n \n \n*(preferred) *\n[use my [i]Install.bat[/i] inside the workshop folder (*STEAM*\\SteamApps\\workshop\\content\\252950\\1287922725) to automatically create the above mentioned symbolic links. \n**PSA: don't blindly execute the .bat if you don't trust my files/don't understand the code!**\n]\n \n__code from Install.bat__\n \n@ECHO OFF\n\n:: // Switching from Workshop folder into RL main folder\ncd....\ncd..\ncd..\ncd..\ncd..\ncd %cd%\\common\\rocketleague\\TAGame\\CookedPCConsole\necho RL Folder: %cd%\necho ...\n\n:: // calling \"CreateRLFolderLink\"(function) for each file needed (definition below)\n\ncall:CreateRLFolderLink RR_Assets_KHS.upk\ncall:CreateRLFolderLink RR_Assets_Lake.upk\ncall:CreateRLFolderLink RR_KHS_Mats.upk\ncall:CreateRLFolderLink RR_Prefabs_KHS.upk\ncall:CreateRLFolderLink RR_rc_lake.upk\ncall:CreateRLFolderLink RR_VersionInfo.upk\n\n\npause\n\n\n\n:: // Function definition \"CreateRLFolderLink\"\n\n:CreateRLFolderLink\n:: // \"%~1\" = Filename passed by function call (from above)\necho File: %~1\n:// Deleting old Link \ndel %~1\n:// Creating new Link; (\"%~dp0\" = folder, where the batch file is = workshop folder)\nmklink /H %~1 \"%~dp0\\%~1\"\necho ...\n\n\n__Step 2:__\n\tfor meaningful gameplay use \nRocket Launcher: <https://www.reddit.com/r/RocketLeague/comments/7462cv/announcing_rocket_launcher_a_program_for_playing/>\n\trecommended settings: unlimited  time, default boost\n \nHow to start a racetrack after loading up:\nOnly the Host can control the ingame Menu! Controlling it should be quite intuitive: use the same Gamepad(!) controls as RL to navigate (keyboard/mouse not really supported at this point)\nTo start a game navigate to 'Multiplayer' -> 'VSRace' -> select the first Cup -> select first Track -> loading screen will come up (yes, loading takes a few seconds even with SSD!) -> after loading you will get a prompt asking if you want to start the countdown\nTo reopen the menu press 'select' + 'right thumbstick' at the same time (default bindings of scoreboard and looking behind)\nTo restart the race just navigate through the menu again!\nMenu Navigation slideshow: <https://imgur.com/a/I6lvb>\n[imgur.com]\n \nadditional Information:\n \n this is the second alpha release, so bugs might (and will!) be found.\n \n\tmore features will definitely come! this alpha is for a first  public game test to get feedback!\n \n I'm no artist, so the look is really basic! ^_^\n \nWant to help develop this Gamemode?\nCome to the RLMods discord and whisper KarlHeinzSchneider#1566 (I'm a Mod there!)\nI'm looking for anyone interested, high demand on 2D artists for Menu/HUD art, and 3D artists for additional race tracks!\n \nError Codes:\n Error #1 - No Package installed | Necessary Packages not installed, see installation guide (\"how to play\") above!\n Error #2 - Wrong Package version installed. | Some Packages and/or old versions installed, please redo the installation as mentioned under \"how to play\"!\n \nKnown Issues:\n \n ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1287922725"}, "Tumble.udk": {"title": "Tumble", "author": "Pastey", "description": "A multiplayer gamemode with map altering power-ups\nv0.2 Alpha\nThis gamemode is still very much a work in progress. As of now, I'm not sure if I'll continue to add new features due to time constraints and UDK limitations. For now my focus will be to maintain this map as it is, so that means fixing bugs that have been introduced after a Rocket League update.\nThis map is meant to be played with 2-8 players. See \nRocket Launcher: <https://rocketleaguemods.com/mods/rocket-launcher>\n[rocketleaguemods.com]\n instructions for how to setup multiplayer.\nWhat is Tumble?\nInspired by the popular Rumble mode in Rocket League, Tumble is a round-robin style gamemode in which players from opposing teams take turns activating power-ups. Power-ups can alter the map in many ways, from objects obstructing goals to moving obstacles that disrupt gameplay. After ten seconds, a player is selected to activate a power-up (indicated by the HUD on the lower left corner of the screen and an arrow above the player's car). They'll have ten seconds to pickup (drive/fly into) one three random power-ups spread throughout the map.\n*tl;dr it's like rumble, but for maps*\nWhat kinds of power-ups are there?\nThere are currently five power-ups available.\n- The Wave: A hump that travels halfway across the map, launching anything that gets in its way.\n- The Wall: A wall that travels halfway across the map, blocking the activator's goal and restricting gameplay to the opposing team's half.\n- Pillars: Black rising pillars that partially obstruct the activator's goal.\n- Dropshot: Like the name suggests, a hole is opened on the opposing team's side, allowing a goal to be score there.\n- Hoops: Like the name suggests, a Hoops goal is activated on the activator's side. This one helps in that in blocks the default goal and makes it harder to score there, but also introduces the Hoops goal which can be harder to defend.\nIssues:\n- Boostpads not fully implemented\n- Pickups sometimes overlap each other\n- HUD doesn't always fully reset upon scoring a goal or reaching overtime\n- Hoops power-up is still buggy\nPlease post a comment if you find other issues. Thanks!\nCredits:\nMajor thanks to KarlHeinzSchneider for helping with multiplayer replication!\nDerzo for helping with level streaming", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1307013183"}, "bigmaptest.udk": {"title": "no map no skybox", "author": "Wildcat", "description": "literaly nothing, no skybox either.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1319687333"}, "RR_rc_Lake.udk": {"title": "[SP] rc_Lake - Racing", "author": "Karl-Heinz Schneider", "description": "standalone SP Version of rc_Lake from RL Racing Royale - no installation steps needed!\nHow to Play:\nAfter loading up through the workshop menu you will get a prompt that asks you if you want so start the time trial (with 5s countdown); in case you clicked 'not yet' or want to restart it later again, press 'scoreboard' + 'rearcamera' (default on gamepad: 'select' + 'right thumb click') and the prompt will open again!\nAlso i would like to see your best times! (complete race, and/or best roundtimes) The best racers will get custom titles for the MP version; just comment with a screenshot!\n**This Map is Singleplayer only! If you want to play it in Multiplayer, please check out the MP Version here: <http://steamcommunity.com/sharedfiles/filedetails/?id=1287922725>!**\n**PSA: This is the first standalone version, so it may contain bugs! please report if you find any, and i will fix them asap.**", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1344694866"}, "SkateParkFinalv1Dot3.udk": {"title": "[LAN] Skate Park by Moist Camel v1.3", "author": "Moist Camel", "description": "Skate Park with Jumps, Half Pipes, B-Ball Hoop, and Loop-y Rings. \nIf you don't see any textures, you might need to add the following texture mod:\n<https://rocketleaguemods.com/mods/textures-for-maps-and-sticky-walls/>\nThanks for Downloading! Leave your feedback.\nv1.3 Changes:\n1. Added LAN support \nYou will need to Download Rocket Launcher in order to play LAN games (AKA with Friends)\n<https://rocketleaguemods.com/mods/rocket-launcher/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1372927879"}, "level2.udk": {"title": "Rocket Park by Raxacory [v2.0.1]", "author": "Rax", "description": "Welcome to the Rocket Park!\nKey Features\n- Race track / obstacle course with lap timer\n- Skate park area\n- LAN support (for \nRocket Launcher: <https://rocketleaguemods.com/mods/rocket-launcher/>\n[rocketleaguemods.com]\n)\n- Training fields\n- Racing oval\n- Tunnel system\n- Ball dispensers\n- Map color swapper\n- In-game track lap leaderboard\n- Giant marble track\n- Three large 'joyride' tracks\n- One short track\nTo Be Added\n- Target practice\n- More props\n- Moving obstacles\nKnown Issues\n- Some area's are not smooth enough\n- The sky seems to have disappeared\nIf you find any issues please let me know in the comments!\nIf you have any ideas let me know as well, if I like them I might add them!\nMy personal best time for the track is 69.978 seconds (as shown in the video above), can you beat my time? Post your times in the comments below!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1386090040"}, "HideAndSeek.udk": {"title": "Hide And Seek #1 - by gidek (2-8 players)", "author": "gidek", "description": "** I spend hundreds of hours making maps for you guys without any benefits. I created a patreon so you can help me getting money out of it. If you like this map please consider a donation. **\n \n<https://www.patreon.com/gidek>\n(1000$ goal reach = start of Hide and Seek #2 development)\nJoin my discord if you have questions, recommandations, or need help setting up multiplayer workshop maps, im there to help you : \n<https://discord.gg/UPVzqBP>\n~~~\nHi guys!\nYou want a fun game mode in Rocket League? You are at the right place!\nI'm so proud to finally release this map after months of work. This is my participation to the JonSandman's mapping contest.\n*If you don't know how to play multiplayer maps, want to discuss with me or give me suggestions, come on the discord i made for this map : *\n<https://discord.gg/jtuyvK2>\n**What's in this map?**\n- New Hide And Seek game mode\n- New map entirely designed for this game mode\n- Dynamic map\n- Great features, Cold/Hot Indicator for seekers\n- Fun for everyone, you don't need to be skilled to enjoy this map :)\n- Finally a map where 4v4 makes sense\n__Rules :__\nI recommend you to play at least in 2v2, but 3v3 and 4v4 are for sure the best ways to go!\nTeams can be unequal, 3v2, 1v4, everything is possible. (prefer more seekers than hiders)\n- Blues are Seekers\n- Oranges are Hiders\nSeekers have to demolish all Hiders before the game ends to win!\nHiders will be slowed every 40 seconds, be careful when you are being chased.\nThe COLD/HOT feature will help you finding the way to your enemy when there are 2:30 minutes left on the clock.\n__When you die as Hider, switch to spectator mode so you can watch the game going and can't false the cold/hot indicator.__\n__Mutators (very recommended) :__\n \nMax Score : 1 Goal\nBoost Amount : Recharge (Fast) \nDemolish : On Contact\n---------------------------------------------------------------------------------------------------------------------------------------\nI want to thank all my bros testers, who helped me getting the motivation i needed to work on this map, JonSandman for hosting this awesome contest and the modding community who helped me learning everything (Derzo your mapping guide is awesome :D)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1419775459"}, "Rugby_P.udk": {"title": "American Football League", "author": "CoCo", "description": "Play \nrugby\n American football on Rocket League!\nThis map is an entry to Jon Sandman's map contest. Check his \nvideo: <https://youtu.be/Ievd9YaTNB8>\n!\n✓ Multiplayer ready : check \nRocket Launcher: <https://rocketleaguemods.com/mods/rocket-launcher/>\n[rocketleaguemods.com]\nto play with your friends!\nBoostpads aren't implemented so I highly recommend using \n**unlimited boost**\n.\n**Be aware that this map might require advanced mechanics in order to score. Make sure to adapt it with mutators to keep the experience fun.**\nPlease feel free to send your suggestions in the comment section!\nHope you'll enjoy. Have fun!\n**Special thank to Jon Sandman for hosting this contest!**", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1420995617"}, "sjb.udk": {"title": "Speed Jump: Boost - By dmc", "author": "dmc", "description": "An obstacle course. Difficulty: Extreme\nNote: To eliminate flickering - Turn off Ambient Occlusion in video settings.\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368"}, "Park_P.udk": {"title": "large flatmap", "author": "Whoops...", "description": "its a large flatmap. i didnt make. i dunno who did. i needed way to play it. I wanted large dribble area", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1426199189"}, "sj2.udk": {"title": "Speed Jump 2 - By dmc", "author": "dmc", "description": "An obstacle course. Difficulty: Intermediate - Hard\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182"}, "rings2.udk": {"title": "Speed Jump: Rings 2 - By dmc", "author": "dmc", "description": "An obstacle course. Difficulty: Intermediate\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766"}, "aaaaaaaaairdribble.udk": {"title": "The Air Dribbling Test", "author": "iRef", "description": "This map was made to test your airdribbling abilities and to see how much ball control you have in the air.\nThis might not be very useful in the game but its more about gaining car/ball control.\nI hope to see everyone trying to beat there records and have as much fun as possible.\nMy personal best height is 1017, and i hope to improve this alot in the future, good luck and have fun airdribbling!!!\nIf you would like to support me and what I do, consider donating.\npaypal.me/iRef123: <http://paypal.me/iRef123>\n ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1471221134"}, "BoxMap.udk": {"title": "The Cave", "author": "CoCo", "description": "The Cave is a small arena with a high ceiling. Would fit very well in a 1v1 or 2v2 configuration.\n**Recommended mutator:**\n \n*unlimited boost*\nPlease feel free to send your suggestions in the comment section!\nHope you'll enjoy. Have fun!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1518686696"}, "normalx15.udk": {"title": "Larger map", "author": "Disto", "description": "x1.5 larger RL map", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1520915243"}, "Yoshi Circuit.udk": {"title": "Yoshi Circuit - MKRL", "author": "Thanrek", "description": "Yoshi Circuit is the first map in a series of maps I'm making.\nIMPORTANT INFO :\n!!!\n You will need these additional files for all the textures to work properly: <https://rocketleaguemods.com/mods/workshop-textures/>\n[rocketleaguemods.com]\n!!!\nThe map has a few big shortcuts over water that I purposely closed, but there are others you can discover if you want to try to speedrun the map :)\nHOW TO PLAY MULTIPLAYER : \n-\nDownload Rocket Launcher: <https://rocketleaguemods.com/mods/rocket-launcher/>\n[rocketleaguemods.com]\n-Launch it and go to Map Swapper, hit refresh, select Yoshi Circuit in the drop-down list and hit Swap\n-Connect to the same Evolve/Hamachi party\n-Create a local lobby on Underpass, with Rumble if you want and let others join it\nContact : thanrek [ at ] \ngmail.com: <http://gmail.com>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1542921391"}, "Open_DribbleNew.udk": {"title": "OpenDribble", "author": "Blood", "description": "Open world with fun staff :)\nThe map file size ~ 190 MB.\nThat mean that all the texture is allready in\nAnd a few exciting features to\nEnjoy!\nif for some reason u cant see the texures\nyou will need to download the texture mod at :\n<https://rocketleaguemods.com/mods/workshop-textures/>\nNew update:\nRamp is chance and fix\nAdd new admin tool\nBall and car fix\nKnown bugs:\nSpawning messages dont work clearly\nOld admin tool dont work at all \"in the star cylinder above where is the flying castle\"\nAir goals and ramp is not symmetrical\nIf any one find more bugs let me know\nI update it so soon because the old ramp must go\nI will keep give updates\nExcept to something great I have some ideas 😁😝😁\np.s\nchack my brother map u can transform in to a skatebored !!! :P\n<https://steamcommunity.com/sharedfiles/filedetails/?id=2122909249>\nIf u want to support\nDonate me :\nBTC : 1LtKJa8Hgtmtk2JiV8Yy5wc5dTj96bD9uh\nETH : 0xab8a977d016fdd9e8aae7e3c3128b3b8881cf5f4", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1546981021"}, "AirDribble_Challenge.udk": {"title": "Air Dribble Challenge", "author": "gidek", "description": "** I spend hundreds of hours making maps for you guys without any benefits. I created a patreon so you can help me getting money out of it. If you like this map please consider a donation. **\n \n<https://www.patreon.com/gidek>\n(1000$ goal reach = start of Hide and Seek #2 development)\nJoin my discord if you have questions, recommandations, or need help setting up multiplayer workshop maps, im there to help you : \n<https://discord.gg/UPVzqBP>\n~~~\nHi,\n*How much time can you keep the ball in the air?*\nJust a simple map while i'm working on a way bigger singleplayer map, coming sometime in 2019.\n- Ball goes up when its fully formed\n- Death zones are next to every walls\n- Both the ball and car trigger the deathzones\n**This map is not meant to reproduce a \"real\" air dribble, just have fun :)**\nDo your best score and challenge your friends!\nMy own record is 13.46s.\n*If you want to help me creating more maps, money is really appreciated^^*\n \n<https://www.paypal.me/gidek>\n(donators will get access to the beta of my next map when its release, sometime in 2019 :p)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1576137650"}, "sjt1.udk": {"title": "Speed Jump: Trials 1", "author": "dmc", "description": "An Obstacle Course. Difficulty: Easy\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091"}, "sjt2.udk": {"title": "Speed Jump: Trials 2", "author": "dmc", "description": "An Obstacle Course. Difficulty: Easy\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736"}, "Broomstick.udk": {"title": "Quidditch Field V5", "author": "renaiku", "description": "Might be broken with the S10 Friends update.\nI'm working on the Grass to be like the RL maps.\nV1: Original upload\nV2: Zero gravity\nV3: I added better lights and textures, still not finished though\nV4: HD textures for the towers\nV5: bug corrections and new gravity\nIt should be playable in multiplayer LAN now. Don't try with bots it might crash since they can't handle 0 gravity (yet ?)\nI'm still working on it, don't worry it's far from the end. I just learned how to 3d model so it's still very basic.\nThanks for the support !", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1633266841"}, "MeshTest.udk": {"title": "Lethamyr's Triple Goal", "author": "Leth", "description": "Check out my youtube channel for some videos of us playing on the map soon:\n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1641185714"}, "Foosball.udk": {"title": "Lethamyr's Giant Foosball Table", "author": "Leth", "description": "Check out my youtube channel for some videos of us playing on the map soon:\n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1641194070"}, "sp.udk": {"title": "Mean Puss Skatepark", "author": "dmc", "description": "Skate Park for Rocket League\nGrind compilation video - SmokieBowls\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135"}, "MeshTest2.udk": {"title": "Lethamyr's Air Hockey Table (2-6 Players)", "author": "Leth", "description": "Welcome to Air Hockey in Rocket League!\nRequired Settings:\n- Boost Amount: Unlimited\nRecommended Settings:\n- Ball Type: Puck\n- Ball Size: Large\n- Ball Bounciness: Low\nThe puck (or ball) spawns on top of the bridge, and there is a barrier between the two halfs of the map to divide players.\nIf you shoot the puck (or ball) through the underpass, the velocity of the puck will be boosted!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1642013257"}, "Dojo.udk": {"title": "Dojo Grounds", "author": "Thanrek", "description": "Dojo Grounds is a standard map set at the top of a Chinese Mountain, in a temple.\nAssets from MK and RL were used.\nThis map is multiplayer friendly so feel free to test it with your friends.\n!!!\n You will need these additional files for all the textures to work properly: <https://rocketleaguemods.com/mods/workshop-textures/>\n[rocketleaguemods.com]\n(this is not obligatory but it fixes the bushes texture, the website is the official website for rocket league modding)!!!\n(If you don't want to create an account on rocketleaguemods, you can download these files on Dropbox here): <https://www.dropbox.com/s/it7myik7r82itn3/Workshop-textures.zip?dl=0>\n[www.dropbox.com]\nContact : thanrek[at]gmail[dot]com", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1644389030"}, "Pinball3.udk": {"title": "Lethamyr's Pinball Table", "author": "Leth", "description": "New map! Check out my youtube channel for some videos of us playing on the map soon:\n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1646208948"}, "BreakTheBankv2.udk": {"title": "Lethamyr's NEW Break the Bank!", "author": "Leth", "description": "Collect points by getting the ball through your coloured rings and bring the ball to your colour's bank! If a goal is scored the collections reset. At the moment it's set to first to 100, but set whatever points you want as a cap. Took us about 30 minutes for someone to reach first to 75.\n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1654147569"}, "BeerPong.udk": {"title": "Lethamyr's Beer Pong!", "author": "Leth", "description": "<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1654631531"}, "PropHunt1.udk": {"title": "Lethamyr's Prop Hunt!", "author": "Leth", "description": "<https://youtube.com/c/lethamyr>\n subscribe for more!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1662983295"}, "PingPong.udk": {"title": "Lethamyr's Ping Pong Table!", "author": "Leth", "description": "Please subscribe :D \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1670110743"}, "r3.udk": {"title": "Speed Jump: Rings 3 - By dmc", "author": "dmc", "description": "An obstacle course. Difficulty: Intermediate - Hard\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424"}, "PoolTable5.udk": {"title": "Lethamyr's Pool Table (must replace Underpass)", "author": "Leth", "description": "<https://youtube.com/c/lethamyr>\nPeople trying to do this solo, you have to use RL Launcher or some other program to run this and replace Underpass with the map in order to spawn the balls", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1675020083"}, "LethWaterPolo.udk": {"title": "Water Polo v2", "author": "Leth", "description": "Lethamyr and glhglh's second version of Water Polo (glhglh's original map from 2 years ago)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1681397558"}, "Battlegrounds2.udk": {"title": "Lethamyr's Battlegrounds v2", "author": "Leth", "description": "<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1686460827"}, "club.udk": {"title": "Cool Club (Actually Works)", "author": "CrxckedNinjaboy72", "description": "Works this time", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1687335126"}, "skee_ball_oxide.udk": {"title": "Skeeball", "author": "itswavybabywoot Wavysways.com", "description": "Skeeball", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1693339890"}, "DribbleChallenge2Overhaul.udk": {"title": "Dribble 2 Overhaul", "author": "0xDigby", "description": "An overhaul of Dribbling Challenge #2.\nThe map can be fully reset without having to back out to the main menu by touching the catfish on the level 1 platform. On the starting platform there are several option toggles.\nThe white orb - \nWhile in Casual mode it will toggle the skip level bindings (dpad up/down). \nIn either of the timed modes it toggles the attempt counters. When the counters are hidden they will appear once level 30 is completed.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1694288506"}, "WhiffleBall.udk": {"title": "[Broken Since Update] Whiffle Ball - Ball Mod By glhglh", "author": "glhglh", "description": "Edit: Working on a fix since the update. Ball curve physics seem to have changed!\nThe Whiffle Ball is Curveball done RIGHT! Compatible with multiplayer.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1695088547"}, "Rugby.udk": {"title": "[Broken Since Update] Rugby Ball - Ball Mod By glhglh", "author": "glhglh", "description": "Spawns a Rugby Ball with full physics. Can be used in default mode or multiplayer. Play around with Mutators for some fun results!\nShowcased here: \n<https://www.youtube.com/watch?v=5KulUVpBXBE>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1695092281"}, "BallInBall.udk": {"title": "[Broken Since Update] Ball Inside Another Ball - Ball Mod By glhglh", "author": "glhglh", "description": "It's literally a ball inside another ball. Play around with Mutators for best results. Multiplayer compatible.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1695094625"}, "DoubleBall.udk": {"title": "[Broken Since Update] Double Ball - Ball Mod By glhglh", "author": "glhglh", "description": "2 Regular Rocket League Balls Attached Together! Multiplayer Compatible.\nShowcased here: \n<https://www.youtube.com/watch?v=g6jZh2YwM84>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1695106652"}, "half_gravity.udk": {"title": "Half Gravity", "author": "Pando", "description": "A map with a inverted gravity half.\nI still can't find a way to rotate the orange team's cars, but what you can do is accelerate and they will automatically turn.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1704623013"}, "Quidditch_v2.udk": {"title": "Quidditch Map By glhglh", "author": "glhglh", "description": "A Quidditch map in the style of Rocket League. Compatible with multiplayer via Rocket Launcher or BakkesMod.\nRecommended settings:\nLow Gravity\nUnlimited Boost\nEverything else is up to you!\nHead over to my twitch, or subscribe to my youtube channel where I will be hosting this map with the gamemode to go with it.\nyoutube.com/glhglh: <http://youtube.com/glhglh>\ntwitch.tv/glhglh_: <http://twitch.tv/glhglh_>\nNote: This is just the MAP mod. The gamemode will be available as soon as possible!\nKnown issues:\nVERY fast shots sometimes do not register as a goal when going through the hoops\nOverlapping transparent objects can flicker\nCeiling is not mirrored", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1743164057"}, "sjt3.udk": {"title": "Speed Jump: Trials 3", "author": "dmc", "description": "An Obstacle Course. Difficulty: Easy\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738"}, "Rugby_v3.udk": {"title": "Rugby Field & Ball By glhglh", "author": "glhglh", "description": "A Rugby Field & Ball Map Mod For Rocket League. Compatible with multiplayer via Rocket Launcher or BakkesMod.\n \n\tRecommended settings:\nSpike Rush (When Released)\nFast Recharge Boost\nKnown bugs:\nIn training (Default Workshop mode) Rugby Ball turns into a regular ball after resetting your car. Do not reset car for now, to keep the Rugby Ball. Multiplayer not affected.\n ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1763097365"}, "t4.udk": {"title": "Speed Jump: Trials 4", "author": "dmc", "description": "An Obstacle Course. Difficulty: Easy\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534"}, "sjt3r.udk": {"title": "Speed Jump: Trials 3 Reversed", "author": "dmc", "description": "An Obstacle Course. Difficulty: Easy-Intermediate\nVideo by: djmexxc\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013"}, "AlexeysCompundAlpha.udk": {"title": "Alexey's Compound Alpha", "author": "Eeo", "description": "Just like for any other Workshop map, if any textures are missing make sure to download the Workshop Texture pack and follow the instructions from: \n<https://rocketleaguemods.com/mods/workshop-textures/>\nType: obstacle course + ball park at the end\nDifficulty: Beginner - Intermediate.\nA non-punishing, beginner-friendly, advanced-oriented obstacle course. At the end you have the central court with the ball at your disposal. Perfect for the first thing you get in to warm up. Some flying then some ball chasing. Feel free to set the rules for yourself: \"as many wall jumps as possible\", or \"no contact with constant air roll\". Don't forget you can fly the map backwards for added variety.\nNote, the map is not as bright as in the video. It's the default Win10 recorder that compresses the color range too much, making bright too bright.\nTo see the full beauty of the map don't forget to set the settings to max.\nShout-out to all Rocket League map makers and modders. I now feel your pain.\nPsyonix & Epic, if you're reading this, please, oh please add better support for us, modders. If we can contribute to RL, the game will live forever. You can keep monopoly on items, but at the very least allow for easier map creation. I mean I've spent probably 6 hours just trying to figure materials and basically failed. I still couldn't create a material of my own, it just wouldn't load in the game. And the one we can re-use from the game engine, there isn't one that supports fully transparent alpha channel. And the blocking volumes! Don't get me started on that! Why do we need to have blocking volumes for every CSG element. I found a work around, but man it's painful. Before exporting I would create a brush the size of the map, intersect it with the geometry and then add one big blocking volume from that.\nTime spent making: ~20 hours", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1767716809"}, "r1.udk": {"title": "Speed Jump: Rings 1 - By dmc", "author": "dmc", "description": "An obstacle course. Difficulty: Hard - Extreme\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~\nDiscord: \ndiscord.gg/KqqPEbB: <http://discord.gg/KqqPEbB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178"}, "amap1.udk": {"title": "LumpyMap_QuickSand_Timed", "author": "daxslashlumpy", "description": "This map has a timer! Try to get to the end as fast as possible! Dont Fall in quick sand! x_x\nIf you would like to donate items to the team, please contact me via Steam (Thanks in advance)  :)\nJoin our discord server for giveaways!!\n<https://discord.gg/KU5dZdv>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1783448502"}, "StreetHoops2.udk": {"title": "Chaos Wizard's Street Hoops", "author": "Legion of Titties", "description": "Time to take it off the court and onto the blacktop. Can you ball with the greatest?", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1786994629"}, "parkour.udk": {"title": "LumpyMap_Parkour", "author": "daxslashlumpy", "description": "This is a parkour map! With a timer! Dont fall!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1788042907"}, "rings.udk": {"title": "LumpyMap_Rings", "author": "daxslashlumpy", "description": "Go threw each ring to pass! Hope you enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1790390969"}, "Shipment.udk": {"title": "Lethamyr's Call of Duty Shipment Remake", "author": "Leth", "description": "Remake of the Call of Duty 4 Map, Shipment", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1800619447"}, "Slaloms_Lobby.udk": {"title": "Slalom-Training", "author": "Dreale", "description": "Just an expansion of the Slalom Training which i created for \n<https://www.twitch.tv/Hashkat>\nFor Textures go to \n<https://rocketleaguemods.com/mods/textures-for-maps/>\n \nand follow the instructions.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1816559771"}, "h.udk": {"title": "Hornets Nest - By dmc", "author": "dmc", "description": "Obstacle Arena. Difficulty: Intermediate\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206"}, "Portal1.udk": {"title": "Lethamyr's Portal in Rocket League!", "author": "Leth", "description": ".", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1828413430"}, "dlg.udk": {"title": "have fun dlg", "author": "iRef", "description": "dlg wanted this map", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1830844041"}, "Map_1.udk": {"title": "Pillar Jungle", "author": "Blango Mango", "description": "To see custom textures you will need to import these. \n<https://rocketleaguemods.com/mods/workshop-textures/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1830912230"}, "Boardwalk.udk": {"title": "Lethamyr's Boardwalk", "author": "Leth", "description": "Subscribe to \nyoutube.com/c/lethamyr: <http://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1836013540"}, "BeachVolleyWall.udk": {"title": "[2-8 Players] Beach Volley with middle wall", "author": "Generating play...3...2...1...", "description": "Original beach volley map made by \nDerzo: <https://steamcommunity.com/id/DerzoDev/myworkshopfiles/>\n.\nI added an invisible wall in the middle. This allows for faster recovery, more ball airtime and more plays!\nHow to play with friends\n<https://www.youtube.com/watch?v=vfIIa2cUZSE>\nRecommended Mutators\nBall type:\t\tBeach ball\nBoost amount:\tUnlimited\nRespawn time:Disable goal reset\nGravity:\t\tLow\n**I recommend a gravity between -400 and -450 in bakkesmod instead of the low gravity mutator for optimal gameplay**\nIf anyone is interested in playing workshop maps with the community, including this map, feel free to join this discord that was created exactly for that! It's full of players hosting games and wanting to try new maps\n<https://discord.gg/kVGR4vB>\nEnjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1838680906"}, "skyblock_2.udk": {"title": "[fixed-unsub & resub] SkyBlock -By Evan", "author": "Evan", "description": "How it works:\n*On the main island there are two goals which each award 2 points. \n*There are two more goals located on the outer islands which award 10 points each.\n*If the ball falls off an island the team of the player who last touched the ball loses a point. \nCommon issues and solutions:\n*Content ID mismatch: Restart your game after your press fix map.\n*Wrong password: In Rocket League go to host a local lobby normally and delete the password.\nSuggested usage:\n*Use \nBakkesMod: <https://bakkesmod.com>\n[bakkesmod.com]\n and the \nRocket Plugin: <https://bakkesplugins.com/plugins/view/26>\n[bakkesplugins.com]\n to swap the map and assign the mutators.\nVideo Tutorial: <https://youtu.be/6Qc_FTDhrSs?t=105>\n*Use LogMein Hamachi to play with your friends. \nclick here: <https://www.vpn.net/>\n[www.vpn.net]\n*Get textures\nclick here: <https://rocketleaguemods.com/mods/workshop-textures/>\n[rocketleaguemods.com]\nSuggested mutators: \n     1) Fast:\n          *Ball physics: Super light\n          *Ball max speed: Super fast\n          *Boost amount: Unlimited\n          *Boost strength: 1.5x\n          *Respawn time: Disable goal reset(Optional, just makes it faster) \n     2)Spike rush\n          *In Rocket plugin under mutators turn Spike Rush on\n          *Boost amount: Fast recharge\n          *Respawn time: Disable goal reset(Optional, just makes it faster) \n     3)Slow\n          *Ball type: cube\n          *Ball Weight: Heavy \n          *Ball size: Gigantic \n          *Boost amount: fast recharge\n          *Respawn time: Disable goal reset(Optional, just makes it faster) \n     4)Find your own mutators for this map and share any combinations that work well(If I like them I will add them to \n         this list)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1840791117"}, "n.udk": {"title": "Noob Dribble - By dmc", "author": "dmc", "description": "A beginner friendly dribbling course. Difficulty: Intermediate\n~~~~~~~~~~~~~~~~~~\nMap list:\nNoob Dribble - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064>\nHornets Nest - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1827631206>\nMean Puss Skatepark - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1641612135>\nSpeed Jump: Boost - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1421195368>\nSpeed Jump 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1429288182>\nSpeed Jump: Rings 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1768760178>\nSpeed Jump: Rings 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1454827766>\nSpeed Jump: Rings 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1671658424>\nSpeed Jump: Trials 1 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1578331091>\nSpeed Jump: Trials 2 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1581379736>\nSpeed Jump: Trials 3 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1759763738>\nSpeed Jump: Trials 3 Reversed - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1767669013>\nSpeed Jump: Trials 4 - \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1763596534>\n~~~~~~~~~~~~~~~~~~", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1843822064"}, "Haunted_TrainStation_P.udk": {"title": "Ghost Hunt", "author": "CodeGeek", "description": "Subscribe to my Youtube! \nyoutube.com/c/GamingwithCodeGeek: <http://youtube.com/c/GamingwithCodeGeek>\nTwitch: \ntwitch.tv/Code_Geek: <http://twitch.tv/Code_Geek>\nI found the Ghost Hunt map files! Make sure you have bakkesmod installed, and install rocket plugin and set the preset to \"Ghost Hunt\"\nPress the Home button on the keyboard to launch rocket plugin while in-game\n<http://bakkesmod.com/>\n<https://bakkesplugins.com/plugins/view/26>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1844291622"}, "haunted_trainstation_p_mapimage_SF.udk": {"title": "Ghost Hunt", "author": "CodeGeek", "description": "Subscribe to my Youtube! \nyoutube.com/c/GamingwithCodeGeek: <http://youtube.com/c/GamingwithCodeGeek>\nTwitch: \ntwitch.tv/Code_Geek: <http://twitch.tv/Code_Geek>\nI found the Ghost Hunt map files! Make sure you have bakkesmod installed, and install rocket plugin and set the preset to \"Ghost Hunt\"\nPress the Home button on the keyboard to launch rocket plugin while in-game\n<http://bakkesmod.com/>\n<https://bakkesplugins.com/plugins/view/26>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1844291622"}, "Haunted_TrainStation_SFX.udk": {"title": "Ghost Hunt", "author": "CodeGeek", "description": "Subscribe to my Youtube! \nyoutube.com/c/GamingwithCodeGeek: <http://youtube.com/c/GamingwithCodeGeek>\nTwitch: \ntwitch.tv/Code_Geek: <http://twitch.tv/Code_Geek>\nI found the Ghost Hunt map files! Make sure you have bakkesmod installed, and install rocket plugin and set the preset to \"Ghost Hunt\"\nPress the Home button on the keyboard to launch rocket plugin while in-game\n<http://bakkesmod.com/>\n<https://bakkesplugins.com/plugins/view/26>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1844291622"}, "Hurdle Challenge Timer 3.udk": {"title": "Hurdle Challenge [Outdated]", "author": "Ebarra0", "description": "Improved Version :\n<https://steamcommunity.com/sharedfiles/filedetails/?id=1874020239>\nA basic map to improve your ground-to-air dribbling skill ! Every Hurdle gets higher and will require even more ball control to pass", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1868975566"}, "GOI_P.udk": {"title": "GOI_StartersCup - v1.02 (Mesh fixes, bug fixes, QOL)", "author": "BIGROBizzle", "description": "The goal is to get the ball into the elevator at the top level. \nPrereqs:\n* Can fly lol\nRules: \n* When playing on True GOI mode consider limiting your reset use. It is a level inspired by Getting Over It, in terms of gameplay and True GOI mode allows checkpoints in the opposite direction adding more challenge.\n* For added challenge play with 'unlimited boost' off.\n* Post your time with a video if possible.. I'd love to see someone else playing this.\n- Playthrough by Lethamyr (on v1.00): \n<https://www.youtube.com/watch?v=NIKEno6yw3U&t=309s>\n- Playthrough by Linkuru (on v1.00): \n<https://www.youtube.com/watch?v=aaHjmXl1v_c>\nThis is my first ever map in RL and there were many hurdles I had to jump through (as do many), but I feel I made an enjoyable experience. This was a testing map which turned into it's own flavor of level. Good news is my workflow has improved and I hope to bring longer and better looking levels. Report any bugs and turn off the bloom if you can't see nuffin.\nHere is a shameless link to my tool which helped create this map: \n<https://github.com/BIGROBizzle/RocketSwitch>\nChange Log:\n- v1.02\n    * Added new mesh for big wall (Final obstacle).\n    * Edited top floor mesh to be more failable.\n    * Fixed regular mode (Should function as intended).\n    * Fixed timer to display minutes and seconds.\n    * Fixed timer displaying more than once.\n    * Fixed some checkpoint stuffs. \n\t--Known Bugs\n\t    * Clipping on the elevator is still nasty. Stay flat on floor and you should be bueno.\n\t    * Modal window for user input seems to break after first use. (Workaround: Restart map)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1872143687"}, "Hurdle_Challenge_W3.udk": {"title": "Hurdle Challenge : How High Can You Go ?", "author": "Ebarra0", "description": "The Final Version of the Hurdle Challenge ! Map designed to improve your Ground-to-Air dribble & your flying skills !\nNew Features :\n- Textures (Grass/Wood)\n- Timer\n- Checkpoint & Respawn\n- Hidden \"Superman Challenge\"\nFeel free to comment with your best time :)\nSpecials thanks to BIGROBizzle who helped me a lot with the understanding of respawn & Checkpoints systems ! Link to  his last map (you should definitively check it out) :\n<https://steamcommunity.com/sharedfiles/filedetails/?id=1872143687>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1874020239"}, "Alfa2.udk": {"title": "The Floor is Lava !! A New Dribbling Challenge !", "author": "Ebarra0", "description": "The Floor is Lava ! Welcome to hell in this new and (very) difficult Dribbling Challenge !\n20 Levels to test your skills and reach the one Ring. Some of these may appear really tough, but they are all possible. You better have to finish first the Dribbling Challenge 2 though, for it's rather a Diamond/Champ map.\nSince it's a pretty big map, please let me know if you face any bug/issue\nPS : Legends say that it's in this place that every toxic RL player will end ;)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1893307036"}, "TerrainProofOfConcept.udk": {"title": "Snowy Mountain - Proof of Concept", "author": "CinderBlock", "description": "WARNING: THIS MAP IS NOT OPTIMIZED AT ALL. It is a massive 730mb terrain, merely uploaded as a proof of concept. Have fun exploring!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1894411230"}, "Haunted Forest.udk": {"title": "Haunted Forest", "author": "Thanrek", "description": "Haunted Forest is a Halloween Special Map. \nIt is a standard map and multiplayer friendly. It might get updates in the future.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1899318033"}, "Circuit23_P.udk": {"title": "Racing - Circuit 23 (Updated to v1.01 lap system overhaul and lots other)", "author": "BIGROBizzle", "description": "Use rocket plugin for multiplayer. Get it at: \n<https://bakkesplugins.com/plugins/view/26>\n* Test the track in training or play with up to 7 of your friends in a race to the finish. (Use Rocket Plugin from bakkes mod method mentioned by CodeGeek)\n* Demo and troll your friends with various traps around the map.\n* Play with limited boost and the be given boost from the rng gawds, as well as the Boost-Strip/Also-Deadly-Trap.\n* Beta lap system in place. (Winners will be displayed, losers will be imprisoned)\n-- v1.01\n* Overhauled lap system. Now considered beta.\n\t** First to 3 laps will be crowned champ at the end on the winners platform. (Hopefully you like this)\n\t** The first player to cross the finish line 3 times will activate an end game timer of 60 seconds. \n\tThe race will end when all player have crossed the finish line 3 times \n\tor the end game timer expires. When the end game timer expires, \n\tplayers who did not finish will be thrown in prison :). Players who manage to \n\tfinish in time will be sent to the winners platform where your position\n\twill show rankings. (To be expanded upon)\n\t** Fixed finish triggers to reset all players that pass through.\n* Added by suggestion: Placed a brand new mesh after the \"giant tire\" which will allow players to reach the dual tubes without needing boost.\n* Added some lighting.\n* Added a reset trigger on some spikes.\n* Added camera object to set starting view.\n* Fixed some uv and textures on the dual tubes and other places.\n* Fixed the boost trap fence showing duplicate mesh.\n \n- To be done \n* Add option to turn off boost. \n* End game will be expanded on and ability to race again is a work in progress.\n* Add dynamic physical meshes as obstacles.\n* Add option to change the number of laps.\n* Add timers for each players run.\n* Still, visuals will be overhauled where necessary.\n* Still, last section of the race may be revised and/or otherwise extended.\n* Still, more traps like dynamic spikes, and gravity wells.\n* Add more reset triggers where necessary.\n* Any good feedback will be implemented where possible.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1900626674"}, "LethDribble.udk": {"title": "Lethamyr's Dribble Challenge", "author": "Leth", "description": "", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1903946125"}, "AimTrainingRL.udk": {"title": "Aim training (new update) - By CoCo", "author": "CoCo", "description": "Shoot the targets and try to get the max score by being as consistent as possibe!\n- Mods -\n**~Easy~**\nGoal sized target. Simple random ground shots, random spawns.\n**~Normal~**\nCustomizable mod :\n- Random target sizes (if not enabled : medium target size)\n- Random wall distances (if not enabled : close distance)\n- Random ball drops (if not enabled : powershot)\n**~Survival~**\nStarts with a large sized target. Each shot, distance from wall increases. After 5 shots, wall distance goes back to its initial position and target size decreases. 3 lives (misses) allowed before game over.\n--------\nIf you wish, you can donate to support me. Thank you!\n<https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=4FGDWBAD95T7Y&source=url>\nIf you have any issues/suggestions, let me know in the comment section.\nHope you'll enjoy. Have fun!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1906378036"}, "snow day map.udk": {"title": "Map (please help)", "author": "CodeGeek", "description": "If anyone knows how to make spawn points, please contact me so i can fix the map.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1910249423"}, "BlockFort.udk": {"title": "Lethamyr's Block Fort (Mario Kart)", "author": "Leth", "description": "Block Fort from Mario Kart", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1913530464"}, "2Fort.udk": {"title": "Lethamyr's 2Fort (Team Fortress 2)", "author": "Leth", "description": "Map may crash. Can take a couple times to load.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1917355948"}, "MiniGolf.udk": {"title": "Mini Car Golf", "author": "Blango Mango", "description": "To see custom textures you will need to import these. \n<https://rocketleaguemods.com/mods/workshop-textures/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1919774645"}, "Nebula.udk": {"title": "Nebula Map By glhglh", "author": "glhglh", "description": "Rocket League in Spaaaaaccceeee. Compatible with multiplayer via Rocket Launcher or BakkesMod.\nRecommended settings:\nUnlimited Boost", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1920037471"}, "GHPong.udk": {"title": "Pong Map By glhglh", "author": "glhglh", "description": "A version of Pong in Rocket League. Compatible with multiplayer via Rocket Launcher or BakkesMod.\nRecommended settings:\nUnlimited Boost\nKnown bugs:\nThe gravity can suck the ball into the net.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1920054792"}, "GHWallBreaker.udk": {"title": "WallBreaker Map By glhglh", "author": "glhglh", "description": "Wraning: MUST be launched in dropshot. Use BakkesMod for now.\nTurning DropShot on it's head. I have placed Dropshot tiles onto the walls. Break them to reveal a goal, and score! Compatible with multiplayer via Rocket Launcher or BakkesMod.\nRecommended settings:\nUnlimited Boost\nDropshot\nKnown bugs: Boost pads are not visible to clients.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1920062382"}, "Canyon.udk": {"title": "Canyon", "author": "CinderBlock", "description": "Massive desert canyon", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1927258546"}, "LethChristmasMap.udk": {"title": "Lethamyr's Christmas Map", "author": "Leth", "description": "Subscribe to my youtube! \n<https://youtube.com/c/Lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1953302222"}, "BBall.udk": {"title": "Lethamyr's Basketball Court", "author": "Leth", "description": "<https://www.youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1961110419"}, "NytroMap.udk": {"title": "Team Nytro Workshop Map -By Evan & Novel", "author": "Evan", "description": "Thumbnail By Day: <https://twitter.com/DaaY_RL13>\nJoin our Discord: <https://discord.gg/bF8XQEJ>\n[discord.gg]\n for additional help and to participate in our workshop events. We will be hosting the workshop map on Google servers so that anyone can join without the installation of Hamachi. Our Discord server will be the best place to find information regarding this. \nCommon issues and solutions:\n*Content ID mismatch: Check “Joining custom map” and then select NytroMap.udk\n*Wrong password: In Rocket League go to host a local lobby and delete the password before hosting.\n*Sky quality low: In Rocket League video settings change texture detail to high quality. \n*Missing textures: Download textures from the link below.\nHow to play with friends:\n*Use \nBakkesMod: <https://bakkesmod.com/download.php>\n[bakkesmod.com]\n and the \nRocket Plugin: <https://bakkesplugins.com/plugins/view/26>\n[bakkesplugins.com]\n to swap the map and assign the mutators.\nHow to install plugins: <https://youtu.be/6Qc_FTDhrSs?t=105>\n*Use LogMein Hamachi to play with your friends. \nclick here: <https://www.vpn.net/>\n[www.vpn.net]\n*Get textures\nclick here: <https://rocketleaguemods.com/mods/workshop-textures/>\n[rocketleaguemods.com]\nSuggested Mutators(parkour) \n          *Parkour is meant to be done with default boost(unlimited does not work because the last level gives \n            you 100 boost)\n          *Boost strength: 1x\n          *Boost amount: Default\n          *Respawn time: Disable goal reset\n          *Match length: unlimited \n          *Demolish: Disabled \nSuggested mutators (stadium): \n          *Respawn time: Disable goal reset\n          *Ball physics: Super light\n          *Ball max speed: Super fast\n          *Boost strength: 1.5x\n          *Match Length: Unlimted\nSpeed run rules:\n          *Runs done on servers will not count due to lag altering the stopwatch time. \n          *Runs will only count with boost amount set to default.\n          *The 33 boost you receive at the beginning can be used.\n          *Run will not count if you begin with more than 33 boost.\n          *Boost strength should be set to 1x\n          *You must go through all portals \n          *Runs will not count if you use unstuck as an exploit. \n Links:\nTeam Nytro Discord: <https://discord.gg/bF8XQEJ>\n[discord.gg]\nTeam Nytro Youtube : <https://www.youtube.com/channel/UCmbQ3SIGZhHN-7XW7s3_Ekw>\nNovel's Youtube : <https://www.youtube.com/channel/UCvqLv57iTy9SwRCrL4fZRjg>\nMy Youtube : <https://www.youtube.com/channel/UC1IlpJegLme6F2j5jfcqNnw>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1961205463"}, "Labs_underpass_p.udk": {"title": "HAHAHAHAHAH PLS PLS WORK", "author": "Deftresthail", "description": "if it dont work i will cry", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1964485930"}, "playground.udk": {"title": "Playgroundv2", "author": "Deftresthail", "description": "deftresthail's Playground", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1964559646"}, "BouncyCastle.udk": {"title": "Lethamyr's Bouncy Castle!", "author": "Leth", "description": "To make the floors bouncy, follow my bouncy castle video", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1977014415"}, "InfiniteOpenMap.udk": {"title": "Infinite Open Map", "author": "devwave", "description": "A simple map for your endless practicing", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1980536388"}, "RainbowRoad64.udk": {"title": "Lethamyr's Rainbow Road (MK64)", "author": "Leth", "description": "sub to my youtube! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1982322601"}, "MaridiaV2.udk": {"title": "Lethamyr's HARDEST Map", "author": "Leth", "description": "sub to my youtube! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1982326851"}, "Catwalk.udk": {"title": "Lethamyr & glhglh's Easter Catwalk!", "author": "Leth", "description": "Enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1982348102"}, "PinkoStart.udk": {"title": "Chaos Wizard's Plinko!", "author": "Legion of Titties", "description": "Come on down! You're the next contestant on...", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1989782092"}, "LethGladiator.udk": {"title": "Lethamyr's Gladiator", "author": "Leth", "description": "Sub to my youtube! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1990340487"}, "Mugzrd_Air_Dribble_Gauntlet.udk": {"title": "MUGZRD'S AIR DRIBBLE GAUNTLET", "author": "MUGZRD", "description": "READ THIS!\nMUGZRD'S AIR DRIBBLE GAUNTLET is a map that challenges your infinite air dribbling skills. If you want to change levels you can press left or right on the dpad. If you want to turn on a guide to show you where to hit the ball to keep it up press up on the dpad. If you have any ideas leave them in the discussions page of the workshop or join my discord to talk to me directly and maybe have access to maps earlier! If you want to support me but not pay anything just show love to my twitter and discord so I know you like what i'm doing.\n Follow my twitter! : <https://twitter.com/Mugzrd>\n \n Join the Discord! : <https://discord.gg/juWrzZh>\n[discord.gg]\n ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1992438961"}, "LethMinecraft.udk": {"title": "Lethamyr's Minecraft Map", "author": "Leth", "description": "", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1994216606"}, "Mansion.udk": {"title": "Lethuigi's Mansion", "author": "Leth", "description": "Enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=1998843439"}, "LethPyramids.udk": {"title": "Lethamyr's Pyramids", "author": "Leth", "description": "Sub to my youtube! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2001266696"}, "LethFloorIsLava.udk": {"title": "Lethamyr's Floor Is Lava Map", "author": "Leth", "description": "This is a Sumo RL map, enjoy <3 Sub to my youtube! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2008755597"}, "Skatepark-Arena.udk": {"title": "Skatepark Arena", "author": "FroYo", "description": "My first map. Another skatepark. Only this time it is an arena.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2014415054"}, "ArcadeHoops.udk": {"title": "Chaos Wizard's Arcade Hoops", "author": "Legion of Titties", "description": "The Great Arcade Hoops Map Revamped for 2020! Under the name of the guy who actaully did all the work on the map!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2018169187"}, "FishBowl.udk": {"title": "Chaos Wizard's Fish Bowl", "author": "Legion of Titties", "description": "FishBowl Early Access Version", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2018200536"}, "LethPitchBlack.udk": {"title": "Lethamyr's Pitch Black Pitch", "author": "Leth", "description": "COMPLETE DARKNESS\nSub to my youtube <3 Thanks for 205k! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2018214879"}, "LethShuffleBoard.udk": {"title": "Lethamyr's Shuffleboard", "author": "Leth", "description": "All you need is unlimited boost, unlimited time, and puck ball type! Enjoy\nSub to my youtube if you haven't for more Rocket League maps! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2018254607"}, "Skeeball2020.udk": {"title": "Chaos Wizard's Skee Ball", "author": "Legion of Titties", "description": "Skeeball Super Awesome Edition - Updated for 2020 with new textures!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2018269238"}, "LethMayanPitz.udk": {"title": "Lethamyr's Mayan Pitz", "author": "Leth", "description": "Enjoy! Finally got this map up on the workshop.\nBe sure to subscribe to my youtube: \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2018789156"}, "LethFoosball.udk": {"title": "Lethamyr's Foosball Table 2.0", "author": "Leth", "description": "Brand new foosball table revamp! Sub to my youtube <3 \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2022663287"}, "LethGlacialRings.udk": {"title": "Lethamyr's Giant Rings Map", "author": "Leth", "description": "The water texture can be fixed by installing the Workshop Textures. Search for Rocket League Workshop Textures and follow the instructions.\nBe sure to sub to my youtube and watch the vid on the hidden easter egg hints! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2025564083"}, "LethSquashCourt.udk": {"title": "Lethamyr's Squash Court", "author": "Leth", "description": "I found the best settings to be:\nBall Physics: Light\nUnlimited Boost\nUnlimited Time\nSub to my youtube if you haven't! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2041362761"}, "LethSkyscraper.udk": {"title": "Lethamyr's Mario Kart Skyscraper", "author": "Leth", "description": "", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2041392356"}, "RMP_Arena.udk": {"title": "RMP Arena", "author": "Nickster", "description": "A custom competition ready map featuring centered goals and ramps for a new and different competitive experience.\nNotes:\nI recommend turning off Goal Speed notifications in BakkesMod because you will get the notification whenever the ball hits the back walls.\nFuture updates to include a full working crowd (yes, of the egg people), possible alterations to further smooth out the weird curve by the goals, and more!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2046817298"}, "Leth4Square.udk": {"title": "Lethamyr's 4-Square", "author": "Leth", "description": ":) Enjoy the map! We played with low gravity, seems to work perfectly!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2048159671"}, "Tubes.udk": {"title": "Tuberacing", "author": "FroYo", "description": "\"There's a goal at the end of the tunnel\"\nYou can either play it as a solo time trial racing track or together with your friends as a cooperative ballchasing game leading to a dramatic showdown at the end. \nBig Shoutout to @TheGreatFakeroni for giving me the idea for this map. Thanks mate.\nHere is a link to a great tutorial on how to play these custom maps with your friends:\n<https://www.youtube.com/watch?v=vfIIa2cUZSE&t=418s>\nFor multiplayer setup I recommend turning off demos (I couldn't figure out how to add respawn points along the track).\nHave fun.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2048180098"}, "flat.udk": {"title": "cool", "author": "Rosekey", "description": "this", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2050702745"}, "TestG.udk": {"title": "RL Custom Training Map but with NO Gravity", "author": "Ebarra0", "description": "Ever wonder what RL looked like without almost any gravity at all ?\nWell let's face it, this would be kinda bad !", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2066079035"}, "LethGoldMine.udk": {"title": "Lethamyr's Wario's Goldmine", "author": "Leth", "description": "You don't need any mutators other than unlimited time if you want to track how long each lap is.\nFeel free to sub to my Youtube for more maps! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2067145056"}, "LethDungeonHeat.udk": {"title": "Lethamyr's Permanent Heatseeker", "author": "Leth", "description": "THIS MAP ONLY WORKS IN LOCAL MATCH THROUGH MAP SWAP\nThe ball spawns in without any mutators, just give yourself unlimited boost.\nFile name must be either LethDungeonHeat.udk or Labs_Underpass_P.upk\nRun through local match to have the ball spawn during countdown.\nSub to my youtube for more custom stuff: \n<https://youtube.com/c/lethamyr>\nHow to play Custom Maps through local match: \n<https://www.youtube.com/watch?v=vfIIa2cUZSE>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2068713760"}, "LethDungeonHeatWall.udk": {"title": "Lethamyr's Heatseeker Tennis", "author": "Leth", "description": "Enjoy the map! Only need unlimited boost as a mutator.\nSub to my youtube for more custom maps, 40+ made so far! \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2069392365"}, "Launcher.udk": {"title": "sugpatchgfn", "author": "pescu10", "description": "sugpatch", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2070733495"}, "LethTetherball.udk": {"title": "Lethamyr's Tetherball (tetherball.dll required)", "author": "Leth", "description": "To play this map properly:\n1. Change the file name extension to .upk instead of .udk (LethTetherball.upk should be the name)\n2. Download the Tetherball.dll plugin (click \"install with bakkesmod\" and the plugin will run on start-up)\n    - Plugin: \n<https://bakkesplugins.com/plugins/view/101>\n3. Host the map through Bakkesmod Rocket Plugin\n    - Check the box \"Playing with custom maps\"\n    - Select LethTetherball.upk in the list\n    - Give the mutator Unlimited Boost\n4. For people connecting:\n    - Open Rocket Plugin\n    - Enter the host's direct ip\n    - Check the box \"joining a custom map\" and select LethTetherball.upk in the list\n    - Click join\nHow to set all this up: \n<https://www.youtube.com/watch?v=vfIIa2cUZSE>\nSpecial thanks to glhglh and Cinderblock for helping with the map:\n<https://twitter.com/GlenHumphrey>\n<https://twitter.com/CinderBlockCB>\nEnjoy the map <3", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2072559117"}, "Competitive_Quiddiche.udk": {"title": "Competitive Quidditch - by gidek", "author": "gidek", "description": "** I spend hundreds of hours making maps for you guys without any benefits. I created a patreon so you can help me getting money out of it. If you like this map please consider a donation. **\n \n<https://www.patreon.com/gidek>\n(1000$ goal reach = start of Hide and Seek #2 development)\nJoin my discord if you have questions, recommandations, or need help setting up multiplayer workshop maps, im there to help you : \n<https://discord.gg/UPVzqBP>\n~~~\nHere it is! A quidditch competitive oriented map; no mutators, only skill!\nThis map is meant for a high skill gameplay, if you are under C2 you should probably add a light ball mutator or rumble so you don't struggle too much to score.\n__Game Rules :__\n \nNO MUTATORS\nLow Ring = 1pt \nMedium Ring = 2pts\nHigh Ring = 3 pts\nQ: Another Quidditch map?\nYes. I played the glhglh map a while ago, it was fun but it lacked competitive aspects, so i created my own version of quidditch.\nPsyonix if you read this, as you can see we can make great maps using only assets from Rocket League, 0% copyrighted content here. So please, give us custom maps support, thank you.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2084049965"}, "LethRCPoolTable.udk": {"title": "Lethamyr's Miniature Pool Table", "author": "Leth", "description": "Enjoy the map!\nUnlimited Time is all you need\nSub to my youtube: \n<https://youtube.com/c/Lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2088284631"}, "LethHoopsStadium.udk": {"title": "Lethamyr's Hoops Stadium", "author": "Leth", "description": "Hoops... but it's Stadium?\nFeel free to sub to my youtube: \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2091105949"}, "AirDribblePillars_MUGZRD.udk": {"title": "AIR DRIBBLE PILLARS", "author": "MUGZRD", "description": "a map made for a friend. use bakkes mod mod to get the ball on your car until updated if updated.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2091448664"}, "BucketPark2.udk": {"title": "TheHoopSquad - Bucket Park", "author": "Mr. Swaggles", "description": "The HoopSquad presents Bucket Park\n⭐\nCome get Buckets with us!: <http://thehoopsquad.com/social/>\n[thehoopsquad.com]\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2094765580"}, "LethRunway.udk": {"title": "The Rocket League Fashion Show", "author": "Leth", "description": "If you decide to use this for videos please credit me with my youtube link & credit BlackWidow at her Twitch:\nMy youtube: \n<https://youtube.com/c/lethamyr>\nBlackWidow's Twitch: \n<https://www.twitch.tv/blackwidowirl>\nThis map was created for BlackWidow for her fashion show.\nEnjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2097503172"}, "HoopsTemplate.udk": {"title": "Hoops Template", "author": "Mr. Swaggles", "description": "Hoops?\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to you, for embarking on this journey!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2098030363"}, "TJBrotherAirDribble.udk": {"title": "Air Dribble Hoops", "author": "tj", "description": "A fun and challenging course to improve your air dribbling.\nSupport me on Patreon: \n<https://www.patreon.com/tjbrother>\nMy info\n<https://twitch.tv/tjbrother>\n<https://twitter.com/tjbrotherlive>\nSpeedruns\n<https://www.speedrun.com/rl>\nWorkshop Textures\n<https://rocketleaguemods.com/mods/workshop-textures/>\nSettings:\nUnlimited Boost: On", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2100268170"}, "ThePit.udk": {"title": "Bump Battle ( Beta )", "author": "Ardivee", "description": "**Welcome to Bump Battle, where you have to bump each other off the arena!**\n*Mutator Settings:*\nDemolition: Disabled\nMatch Time: Unlimited\nMatch Goals: 3 / 5\n**U need Bakkedmod to play this map with friends!**\nThis map is still in beta, there may be a few bugs. If you find something please report it!\n~Ardivee", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2101125846"}, "LethLavaRings1.udk": {"title": "Lethamyr's Lava Rings", "author": "Leth", "description": "This is a reskin of my Giant Ice Rings Map, expect a new format with this theme at some point!\nSub to my youtube for more, this is my 49th map: \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2104185189"}, "LethStarWars.udk": {"title": "Lethamyr's Star Wars Map", "author": "Leth", "description": "Enjoy this standard map. Change to Labs_Underpass_P.upk to play this in freeplay (mods folder directory)\nThanks to Nickster for helping get boosts to work!\nSub to my youtube for 49 (currently) other maps and more unique content for Rocket League: \n<https://youtube.com/c/lethamyr>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2105325631"}, "parkourfirst.udk": {"title": "Parkour Course V1", "author": "Fara Sherazi", "description": "This is the first map I created, so I'm open for critics and bug reports in the comments.\nIf you like my little parkour course I'm open to create more maps of this style.\nIt's supposed to be played without boost. Have fun and enjoy.\nI made some graphic changes and fixed the sticky walls. Please let me know If you encounter any bugs.\nI also uploaded my second project to the workshop:\n<https://steamcommunity.com/sharedfiles/filedetails/?id=2126337013>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2105330073"}, "Dinosaurs.udk": {"title": "Dinosaurs", "author": "FroYo", "description": "This map is based on the drawings my 6 year old son made. \nIt's basically regular rocket league with dinosaurs.\nHave fun.\nHow to play these custom maps with your friends.: <https://www.youtube.com/watch?v=vfIIa2cUZSE&t=418s>\nPS: Making the animations and movement of the dinosaurs work for multiplayer setup was a bit of a struggle and it might still be a little glitchy here and there. But it should be playable. \nPPS: Don't trust the replays.\nUpdate July 7th 2020: Fixed the problem witch the dinosaurs sometimes not coming back to life at kickoff (I think).", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2113005884"}, "DarkStadium.udk": {"title": "Neon Stadium", "author": "Ardivee", "description": " Features \nCar Lights\nWorking Boost Pads\nNeon, lots of neon!\nPlease report any bugs", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2113864791"}, "WhiffRings2.udk": {"title": "Lucid Rings", "author": "Whifftastic", "description": "Lucid Rings is an aerial training rings map of medium-hard difficulty. Whifftastic | Huss Gaming\n~~~~~~\nMUST HAVE WORKSHOP TEXTURE PACK FOR VISUALS: (Map still functions as normal)\nIf you do not have the texture pack go to \n<https://rocketleaguemods.com/mods/workshop-textures/>\ndownload the file and extract the files into c:\\program files (x86)\\steam\\steamapps\\common\\rocketleague\\tagame\\cookedpcconsole\nAlternatively, I included the files you need into the workshop download. So you already have the files and can find them in c:\\program files (x86)\\steam\\steamapps\\workshop\\content\\252950\\2116244468 and drag the two .upk files into the cookedpcconsole location as described above.\n~~~~~~\nCurrent World Record (1:23)\nLink: Spoiled_milkers - 1:23 \n<https://youtu.be/Zz5XjBK6aTc>\nPost your full run video from youtube in comments to have your video linked here!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2116244468"}, "LethSumoAir.udk": {"title": "Lethamyr's Air Sumo", "author": "Leth", "description": "The 3rd Installment of my Sumo Map Series.\nFans push you upwards, boost pads work as normal.\nSubscribe to my youtube for 50+ other custom maps \n<https://youtube.com/c/lethamyr>\n Nearly 300k!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2116461958"}, "test_matchmaking.udk": {"title": "Parck Bekckwith - Portal Edition version Beta 1.1", "author": "PetiPadawone", "description": "Please download the Workshop textures on \nrocketleaguemods.com: <http://rocketleaguemods.com>\n to have the map fully loaded.\nIt is a matchmaking ground, there are two panels attached to the backboards which are the entrance gates, and the exit portal is a cannon in the center of the ceiling which rotates on a 360 ° axis, enjoy it!\nI will update this version with better textures, grass, etc..", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2117922667"}, "WhiffRings1.udk": {"title": "Impossible Rings", "author": "Whifftastic", "description": "Impossible Rings is a very difficult aerial training course. This map will give you a headache from the tight rings to the camera angles and is not recommended for the faint of heart. This was my first map that I was going to leave a beta but decided to texture and release after completing Lucid Rings. Whifftastic | Huss Gaming\n~~~~~~\nMUST HAVE WORKSHOP TEXTURE PACK FOR VISUALS: (Map still functions as normal)\nIf you do not have the texture pack go to \n<https://rocketleaguemods.com/mods/workshop-textures/>\ndownload the file and extract the files into c:\\program files (x86)\\steam\\steamapps\\common\\rocketleague\\tagame\\cookedpcconsole\n~~~~~~\nCurrent World Record (0:54)\nLink: \n<https://www.youtube.com/watch?v=RXbKdNqo-uc&feature=youtu.be>\nBeat this time? Post your full run video from youtube in comments to have your video linked here!\n~~~~~~\nImpossible Rings 2 & Training Course: \n<https://steamcommunity.com/sharedfiles/filedetails/?id=2143776633>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2120912805"}, "SkateMap.udk": {"title": "The Skate Challenge", "author": ".", "description": "Turn your car into a skateboard then dribble to air-dribble your way or flick out a goal !\nSpecial thanks to my brother in real life, the kismet master ! check out his map too -\n<https://steamcommunity.com/sharedfiles/filedetails/?id=1546981021>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2122909249"}, "parkoursecond.udk": {"title": "Parkour Course V2", "author": "Fara Sherazi", "description": "This is the second map I created and I'm always open for critics and bug reports in the comments. If you like my short and challenging parkour course I'm open to create more maps of this style.\nIt's supposed to be played without boost. Have fun and enjoy.\nYou can leave a thumbs up If you enjoy my content. :)\nThis is my first project:\n<https://steamcommunity.com/sharedfiles/filedetails/?id=2105330073>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2126337013"}, "Tronthemed parkourmap.udk": {"title": "Tron themed parkour map", "author": "Zicronstorm", "description": "Before playing make sure that \"unlimited boost in freeplay\" is unchecked", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2131261198"}, "Tutorial.udk": {"title": "City Scape (THE PIT)", "author": "Ellbell", "description": "Hey! This is my first map.\nBasically it's just a normal rl map, but it has a middle platform, and a pit in the middle!\nHope you like it :)\n(also I have a youtube channel)\nlink: \n<https://www.youtube.com/channel/UCKiDHfkK8jhlHN-az0aaSVA?view_as=subscriber>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2134325899"}, "bboarder.udk": {"title": "bboard", "author": "Evan", "description": "yuh", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2138869987"}, "sidewall4.udk": {"title": "sidewaller", "author": "Evan", "description": "Map created for Nytro Mix: \n<https://www.youtube.com/watch?v=P4K3ogXgpIc>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2140195889"}, "Minigolf.udk": {"title": "Minigolf", "author": "FroYo", "description": "Another Minigolf map. 9 holes in total. Hole scored = next course\nSingle Player \nYou are supposed to score on the red side. Just like in regular minigolf, your touches are being counted. The only difference: you are allowed to touch the ball while it is still moving. Some courses even require this second touch to properly get over the obstacle, like the loop for instance.\nKnown issues: \nUnfortunately I could not access the ingame  touch counter (if anyone knows, how to do this, please leave it in the comments below), so I had to come up with a semiperfect workaround, which works fine most of the time. \nMultiplayer \nIt is supposed to be played like regular Rocket League. Blue team has to score on the red side and vice versa. You should increase the match length to 20 minutes or unlimited, if you want to play on every course. You will also need unlimited or recharging boost. Touch counter and scores are disabled in this mode (Unless you all join the blue team. Then the game starts in \"single player mode\" with scores and touch counter and you can play the courses cooperatively). \nHow to play custom maps with your friends.: <https://www.youtube.com/watch?v=vfIIa2cUZSE&t=418s>\nHave fun.\nUpdate july 10th 2020:\nFixed the touch counter. Should be accurate now.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2142821184"}, "LethSpaceHnSFull.udk": {"title": "Lethamyr's Spaceship Hide n Seek (FULL SIZE)", "author": "Leth", "description": "This is the full version of this map (7000 Models)\nYour computer may struggle to load/handle this map with frames, so I have a second version on the workshop with 1 main room removed, and a total of 1500 models removed to help with running as host.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2143701346"}, "LethSpaceHnSShrunk.udk": {"title": "Lethamyr's Spaceship Hide n Seek (REDUCED SIZE)", "author": "Leth", "description": "This is the reduced size (5500 Models) version of my Spaceship Hide n Seek map to help with frames.\nChanges:\n- Water Storage Room completely removed\n- Shortened hallways (removing some models)\n- Removed details that didn't directly provide hiding spots\nEnjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2143705814"}, "LethHospitalHnS.udk": {"title": "Lethamyr's Hospital Hide n Seek", "author": "Leth", "description": "Enjoy yet another Hide n Seek creation!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2143716014"}, "IR2.udk": {"title": "Impossible Rings 2", "author": "Whifftastic", "description": "~ READ DESCRIPTION ~\n VIDEO GUIDE LINKED WITHIN THE PREVIEW PHOTOS ABOVE \nThis is a very hard aerial challenge course for those who have mastered or wish to challenge their aerial control. There are 5 levels of increasing difficulty. There is also a short training course for those needing more practice and a level select for if you wish to try your luck on the next level. These rings are small, hard to maneuver and will put your car control to the test. \nPlease watch the video linked above to gauge the skill level of this course.\n~~\nImpossible Rings 2 [No Reset Version]:\n<https://steamcommunity.com/sharedfiles/filedetails/?id=2158336944>\nThere is an issue with the resets when using the octane hitbox on level 5. I ran through one perfect run, then on my second back to back run I encountered one of these mystery resets. I spent 5 hours trying to figure out what was happening to no avail. The only thing I can do is apologize for any confusion or frustration and offer a guaranteed no reset version of the map for those having issues.\n~~\nMUST HAVE TEXTURE PACK INSTALLED (Map still functions without it)\nIf you do not have the texture pack go to \n<https://rocketleaguemods.com/mods/workshop-textures/>\ndownload the file and extract the files into c:\\program files (x86)\\steam\\steamapps\\common\\rocketleague\\tagame\\cookedpcconsole\n~~\n $25 Steam Gift Card \nReward for the FIRST person who completes a no death/reset, 100% run of levels 1-5 in under 6 minutes (360 seconds). Must link YouTube video with no transitions/filters (music is okay), with the end time clearly displayed after completion, in the comment section.\nKaokor - \n<https://www.youtube.com/watch?v=_uW9nvnVzZI>\n~~\nWorld Record Time Levels 1-5:\n1) Kaokor - 4:50 [No Reset Version] \n<https://www.youtube.com/watch?v=_uW9nvnVzZI>\n2) Whifftastic - 5:58 [Original Version] \n<https://www.youtube.com/watch?v=p7QIFls6R80>\n3) N/A\nWorld Record Practice Course Time:\n1) Kaokor - 0:27 [No Reset Version] \n<https://www.youtube.com/watch?v=tJspEEaj0Jc&feature=youtu.be>\nWorld Record ??? Time:\n1) N/A\n**Beat any of these times? Comment the link to your full run video from YouTube and have your video linked here!**\n~~\nTips:\n* If possible, after you bump in to a ring, let off the boost, adjust and then recover.\n* The poles holding the rings up are purely cosmetic, you can pass through some of them while recovering.\n* Your camera angle naturally falls slowly into the direction the nose of your car is pointing.\n* Toggling on and off your ball cam will instantly snap the camera to the direction your nose is pointing.\n* In level 5, a static halo indicates it is a warp ring (the course continues in the direction you were traveling).\n* Don't panic when the camera angle changes on an upward/downward series of rings. Plan and be ready for when it does.\n* Try to look ahead to see where you need to go next.\n* The gravity is standard. Consider throttling the boost and/or boosting towards the next ring sooner while changing the momentum of your car.\n* Some rings are less forgiving than others. Your best bet is to not touch any at all.\n* Final times are displayed in seconds.\n* If you are having trouble with a level, check out the video linked above of a complete run!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2143776633"}, "gidek_challenge_1.udk": {"title": "gidek Challenge #1", "author": "gidek", "description": "**If you want a gidek Challenge #2 you gotta support me :**\n<https://www.patreon.com/gidek>\n<https://www.paypal.me/gidek>\nJoin my discord if you have any questions, issues, or just want to discuss with me :)\n<https://discord.gg/UPVzqBP>\n--------------------------------------------------------------------------------------------\nWelcome to the gidek Challenge #1!\nA new map inspired by Portal design and mechanics. \nIf you are looking for a map that challenges your skills you are at the right place!\n*Can you beat it?*\n**3 Modes :**\n__Classic mode :__\n The mode you should play first that includes everything to enjoy the map as its finest :)\n__Speedrun mode :__\n Includes a custom overlay for speedrunners\n__Select level :__\n Play the level you like!\n*I'm so excited to release this after so much work and i'm looking forward to make this the best map series on the workshop!*", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2147571346"}, "BucketParkBlackout.udk": {"title": "Bucket Park: Blackout", "author": "Mr. Swaggles", "description": "TheHoopSquad proudly presents Bucket Park: Blackout\n__We stand with the Black community and its allies against systemic racism and police brutality__\nGeorge Floyd. Breonna Taylor. Ahmaud Arbery. Tamir Rice. Trayvon Martin. Oscar Grant. Elijah McClain. Eric Garner. Philando Castile. Samuel Dubose. Sandra Bland. Walter Scott. Terrence Crutcher. Andres Guardado. \nTAKE ACTION\n Participate in a Protest / Have the difficult conversation about racism with your loved ones. Remind them their ignorance and lack of empathy is what is fueling our world's social struggles.\n Donate to BLM Initiatives. Here are some we've personally selected:\n BET + United Way - Saving Our Selves: \nsecure.unitedway.org/j/step/bet-covid-19-donate: <http://secure.unitedway.org/j/step/bet-covid-19-donate>\n American Civil Liberties Union - Racial Justice: \nwww.aclu.org/issues/racial-justice: <http://www.aclu.org/issues/racial-justice>\n Campaign Zero - Police Brutality: \nwww.joincampaignzero.org/: <http://www.joincampaignzero.org/>\n The Black Emotional & Mental Health Collective: \nwww.beam.community/: <http://www.beam.community/>\n Support Minority-Owned Businesses and Content Creators!\n \n**MOST IMPORTANTLY -**\n Exercise your right to VOTE! We won't see change by retweeting a hashtag or subscribing to a Rocket League map. Don't let this be a trend, and let's make a difference!\n#SayTheirNames and Get Buckets!\n**Follow TheHoopSquad:**\nthehoopsquad.com/social: <http://thehoopsquad.com/social>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2147844526"}, "IR2NR.udk": {"title": "Impossible Rings 2 [No Reset Version]", "author": "Whiffaholic", "description": "~ READ DESCRIPTION ~\nTHIS IS A NO RESET VERSION OF IMPOSSIBLE RINGS 2\nThis version will provide you with an opportunity to play the challenge map without the fear of being unjustly reset. These issues did not occur with the dominus, however the octane hitbox did experience some issues with the resets.\nNote:\nThis map was designed to be played solo. If you join in with a friend and cannot reset shot, you have to leave to get back to the start. Also note that I experienced the camera lagging in the warps on level 5 using Hamachi when playing with friends.\nChanges:\n*Removed all resets around rings\n*Changed the color of the warp rings to red\nOriginal Version:\n<https://steamcommunity.com/sharedfiles/filedetails/?id=2143776633>\nThere was an issue with the resets when using the octane hitbox on level 5. I ran through one perfect run, then on my second back to back run I encountered one of these mystery resets. I spent 5 hours trying to figure out what was happening to no avail. The only thing I can do is apologize for any confusion or frustration and offer a guaranteed no reset version of the map for those having issues.\n~~ VIDEO GUIDE LINKED WITHIN THE PREVIEW PHOTOS ABOVE ~~\nThis is a very hard aerial challenge course for those who have mastered or wish to challenge their aerial control. There are 5 levels of increasing difficulty. There is also a short training course for those needing more practice and a level select for if you wish to try your luck on the next level. These rings are small, hard to maneuver and will put your car control to the test.\nPlease watch the video linked above to gauge the skill level of this course.\n~~\nMUST HAVE TEXTURE PACK INSTALLED (Map still functions without it)\nIf you do not have the texture pack go to \n<https://rocketleaguemods.com/mods/workshop-textures/>\ndownload the file and extract the files into c:\\program files (x86)\\steam\\steamapps\\common\\rocketleague\\tagame\\cookedpcconsole\n~~\n~ $25 Steam Gift Card ~\nReward for the FIRST person who completes a no death/reset, 100% run of levels 1-5 in under 6 minutes (360 seconds). Must link YouTube video with no transitions/filters (music is okay), with the end time clearly displayed after completion, in the comment section.\nKaokor - \n<https://www.youtube.com/watch?v=_uW9nvnVzZI>\n~~\nWorld Record Time Levels 1-5:\n1) Kaokor - 4:50 [No Reset Version] \n<https://www.youtube.com/watch?v=_uW9nvnVzZI>\n2) Whifftastic - 5:58 [Original Version] \n<https://www.youtube.com/watch?v=p7QIFls6R80>\n3) N/A\nWorld Record Practice Course Time:\n1) Kaokor - 0:27 [No Reset Version] \n<https://www.youtube.com/watch?v=tJspEEaj0Jc&feature=youtu.be>\nWorld Record ??? Time:\n1) N/A\n**Beat any of these times? Comment the link to your full run video from YouTube and have your video linked here!**\n~~\nTips:\n* If possible, after you bump in to a ring, let off the boost, adjust and then recover.\n* The poles holding the rings up are purely cosmetic, you can pass through some of them while recovering.\n* Your camera angle will naturally fall into the direction the nose of your car is pointing over time.\n* Toggling on and off your ball cam will instantly snap the camera to the direction your nose is pointing.\n* In level 5, a static halo around a red ring indicates it is a warp ring (the course continues in the direction you were traveling).\n* Don't panic when the camera angle changes on an upward/downward series of rings. Plan and be ready for when it does.\n* Try to look ahead to see where you need to go next.\n* The gravity is standard. Consider throttling the boost and/or boosting towards the next ring sooner while changing the momentum of your car.\n* Some rings are less forgiving than others. Your best bet is to not touch any at all.\n* Final times are displayed in seconds.\n* If you are having trouble with a level, check out the video linked above of a complete run!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2158336944"}, "LethRapidFire.udk": {"title": "Lethamyr's Rapid Fire", "author": "Leth", "description": "Score the balls in your own net to gain points!\nRegular Ball: 1 Point\nDropshot Ball: 2 Points\nHeatseeker Ball: 5 Points\nBoost Recharge or Unlimited\nUnlimited Time", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2173534712"}, "LethForest.udk": {"title": "Lethamyr's Forest", "author": "Leth", "description": "enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2175516434"}, "LethSumoVolcano.udk": {"title": "Lethamyr's Volcano Sumo!", "author": "Leth", "description": "enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2175519326"}, "Zeppelin.udk": {"title": "Zeppelin", "author": "jubi", "description": "Simulates the inside of a Zeppelin.  Use with Unlimited Boost.\nMeshes created by Tombst0ne:  \n<https://steamcommunity.com/id/Tombst0ne/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2177593786"}, "Futsal.udk": {"title": "Futsal", "author": "Mr. Swaggles", "description": "The DunkHouse has been reborn as a soccar court.\nFutsal, from the Spanish \"Fútbol de salón\" or Portuguese \"Futebol de salão,\" is a fast-paced, highly technical form of the sport. Set in an indoor arena on a solid floor, it consistently delivers flashy moves and impressive scorelines.\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2180216056"}, "wall_ball.udk": {"title": "Wall Ball Arena! (FIXED)", "author": "Morphew", "description": "ATTENTION: you need the workshop textures below for this map, or else the goals will appear black.\nThis is my first map that I started making last year for fun and just recently finished it. The map leans towards 1v1 or 2v2 game modes. I think this maps idea has potential but as you can tell from its aesthetics it stands as just a test map. Please try it out and have fun!\nUPDATE: \nThis map should now be fixed with new and improved boost pads and less texture errors :)\nWorkshop Textures\n<https://rocketleaguemods.com/mods/workshop-textures/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2184662209"}, "Breakout.udk": {"title": "Newk's Breakout! [Brick Breaker!]", "author": "Newk", "description": "Multiplayer is FIXED! \nBreak the Bricks, Ride the Pipe, Score a Goal!\nTIMELINE:\n✅ - Multiplayer Update, Particle Fix, Blocker Fix.\n✅ - Boost Pill Visual Fix.\n⬜ - Single-Player/Bot Implementation (ETA Late Aug).\n1️⃣: DOWNLOAD THESE WORKSHOP TEXTURES:\n<https://rocketleaguemods.com/mods/workshop-textures/>\n2️⃣: INSTALL BAKKESMOD & ROCKET PLUGIN:\n<https://bakkesplugins.com/plugins/view/26>\n3️⃣: HOW TO PLAY MULTIPLAYER:\n<https://youtu.be/5toTzPa3S9o>\n4️⃣: (Platinum -> GC) MUTATORS:\nMatch Length: Unlimited\nMax Score: 1 Goal\nBall Physics: Light\nBoost Amount: Normal\n \nOR\n4️⃣: (Bronze -> Gold) MUTATORS:\nMatch Length: Unlimited\nBall Physics: Light\nRumble: Spikes Only\nBoost Amount: Unlimited\nEnjoy! Special Shout out to Evan, Mr. Swaggles, FroYo, Thanrek, Derzo, Gidek, Martinn, and Lethamyr for their Discord support. This is my first map, more to come! If any Content Creators like what you see and want to support more in the future, please credit my Twitch handle, Newk_TV and don't forget to sign my profile!  ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2184895682"}, "KegbobHoopsLab.udk": {"title": "Kegbob Hoops Lab", "author": "Kegbob", "description": "A Kegbob 'Hoops Lab' style map for your hoops rotations. Credit to Mr. Swaggles for technical support.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2186915751"}, "round.udk": {"title": "RoundSpace", "author": "badubies", "description": "My first map. A round map with goals on the ceiling. Standard spawns and boost pads. Easier with low gravity.\nLet me know what you think, or how it could be better.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2187553287"}, "TJBrotherBeatSaber.udk": {"title": "Beat Saber", "author": "tj", "description": "Fun rhythm game to improve your car control.\ntjbrother\n<https://twitch.tv/tjbrother>\n<https://twitter.com/tjbrotherlive>\n<https://discord.gg/rrzADAt>\nmugzrd\n<https://twitter.com/Mugzrd>\n<https://discord.gg/JTdtUXg>\nWorkshop Textures\n<https://rocketleaguemods.com/mods/workshop-textures/>\n-------------------------------------------------------------------\nHow to contribute\n* Open map in UDK\n* Define target orientations\n* Send map to tjbrother\nLet's say you want to create Firework (Melad remix) by Hollywood Principle.\nIn UDK, open Kismet.  Go to the sequence 'InitLists -> HollywoodPrincipleFireworkMeladBeats'.\nIn that sequence, every eighth note in the song has a specific target orientation.\nThere are 27 orientations. Make sure to use the correct prefix, in this case 'Firework'.\nOrientations:\n* FireworkNullPos\n* FireworkStraightUpPos\n* FireworkStraightDownPos\n* FireworkUpNorthWestPos\n* FireworkUpNorthPos\n* FireworkUpNorthEastPos\n* FireworkUpEastPos\n* FireworkUpSouthEastPos\n* FireworkUpSouthPos\n* FireworkUpSouthWestPos\n* FireworkUpWestPos\n* FireworkLevelNorthWestPos\n* FireworkLevelNorthPos\n* FireworkLevelNorthEastPos\n* FireworkLevelEastPos\n* FireworkLevelSouthEastPos\n* FireworkLevelSouthPos\n* FireworkLevelSouthWestPos\n* FireworkLevelWestPos\n* FireworkDownNorthWestPos\n* FireworkDownNorthPos\n* FireworkDownNorthEastPos\n* FireworkDownEastPos\n* FireworkDownSouthEastPos\n* FireworkDownSouthPos\n* FireworkDownSouthWestPos\n* FireworkDownWestPos\nWhen you are done, send the map to me (tjbrother) via discord.  I will update the map and give you credit on the song's sign.\nIf you want to make a song that doesn't have a 'Help Wanted' sign, please ask.  I will update the map with the requested song.\nThis map only supports Rocket League songs.\nHappy creating!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2188820362"}, "LethBeachBrawl.udk": {"title": "Lethamyr's Beach Brawl", "author": "Leth", "description": "Enjoy", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2193084881"}, "LethInsideOut.udk": {"title": "Lethamyr's Inside Out", "author": "Leth", "description": "Enjoy :D", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2200527975"}, "PanicsAirRace.udk": {"title": "Panic's Air Race: Beach (Rings)", "author": "Panic", "description": "Join the Air Race Discord!: <https://discord.gg/CVmFzn4>\n[discord.gg]\n \n \n**• Over 1,300 members and plenty of people to race with\t• Weekly Multiplayer Tournaments with cash prize pools & multiplayer setup guides\t• Leaderboards with videos of the fastest players' laps & more\t**\nSUPPORT AIR RACING: <http://.>\n[http//.]\nThe end goal of Air Racing is to have multiple maps and tournaments with prize pools that showcase the fastest and most consistent players. We are already making huge steps towards this goal, and by simply getting involved via the following links you can support our goal:\n**Twitter: <https://twitter.com/RL_AirRace>**\n**Twitch: <https://www.twitch.tv/rlairrace>[www.twitch.tv]**\n**Youtube: <https://www.youtube.com/channel/UCzeJSsjRoAxaVaXJzRg5nJg?>**\nMap Contributors\n Last but not least, I need to give massive credit to the following two people in particular:\n \n**Mr. Swaggles**\n \nThe creator of many maps & the Discord mapmaking admin, Swaggles is a blender wizard and really helped to bring the map to life with some great models and texture ideas. Has a great guide on mapmaking and without his help I would have struggled to learn anything about UDK. Cheers for everything mate :)\n**Gidek**\nAnother creator of many maps and a coding genius. I had no idea how I would be able to implement the features like race standings, but this guy just came along and made it look easy. The racing functionality side of things is all him. You the man :D\n \nHope to see some of you on the race track!\n \nPanic.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2204381361"}, "TJBrotherHexagon.udk": {"title": "Hexagon", "author": "tj", "description": "Support me on Patreon: \n<https://www.patreon.com/tjbrother>\nHexagons disappear 1 second after touching them.  Be the last to survive by avoiding other players or bumping them off in this sumo-like map.\nThis workshop map was inspired by Minecraft's TNT Run and Fall Guys.  Hope you enjoy! \nRecommended Settings\n- Match Length: Unlimited\n- Boost Amount: No Boost or Recharge (Slow)\n- Rumble: None, Destruction Derby, or Spring Loaded\n- Demolish: Disabled\nNotes\n- The ball's only purpose is to help you see.  Maybe there are some strats involving ball control.\n- Can play with teams or ffa.\n- If you turn on Rumble, keep in mind you can teleport to/from the jails.\n- Edges are hard to deal with.  If you turtle, you will clip the edges.\ntjbrother\n<https://twitch.tv/tjbrother>\n<https://twitter.com/tjbrotherlive>\n<https://discord.gg/rrzADAt>\nWorkshop Textures\n<https://rocketleaguemods.com/mods/workshop-textures/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2204917070"}, "LethDropshot.udk": {"title": "Lethamyr's Standard Dropshot", "author": "Leth", "description": "Only mutator I suggest is: Slow boost recharge", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2208000131"}, "TheFloorIsVoid.udk": {"title": "The Floor Is Void", "author": "Pioneer", "description": "Red walls only block the ball, the grey walls work as usual.\nEverything is still a bit ugly, since it's my first map and I haven't figured out, how to decrypt the RL files for additional meshes and materials/textures.\nRecommended mutators:\n- Boost Amount: Unlimited\n- Boost Strength: 1.5x\n- Gravity: Low\n- Game mode: Rumble (optional)\nIf you seek a challange, try out 'Gravity: Reverse'.\n---------------------------\nWatch \n<https://www.youtube.com/watch?v=vfIIa2cUZSE>\n on how to play workshop maps. You don't need to replace/rename the map anymore, you can load it directly via the workshop folder.\nCredits to \n<https://rocketleaguemods.com/mods/udk-2015-simple-setup/>\n for providing me the necessary tools to create this map.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2208102103"}, "ringsmap.udk": {"title": "New rings map", "author": "Zicronstorm", "description": "New rings map made with the help of NewkTV and similar background to Lethamyr's rings map", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2208838559"}, "TJBrotherAirDribbleMelee.udk": {"title": "Air Dribble Melee", "author": "tj", "description": "Multiplayer map inspired by \nFroYo's Minigolf: <https://steamcommunity.com/sharedfiles/filedetails/?id=2142821184>\n.  There are 9 levels, all centered around air dribbling.  Play 1v1, 2v2, 3v3, or 4v4.\nSettings\n- Match Length: Unlimited\n- Boost Amount: Unlimited\nSpawn ordering\n- Spawn 1: offensive\n- Spawn 2: defensive\n- Spawn 3: defensive\n- Spawn 4: offensive\nSupport me on Patreon: \n<https://www.patreon.com/tjbrother>\n<https://twitch.tv/tjbrother>\n<https://twitter.com/tjbrotherlive>\nWorkshop Textures\n<https://rocketleaguemods.com/mods/workshop-textures/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2215294712"}, "LethBubble.udk": {"title": "Lethamyr's Bubble Sumo", "author": "Leth", "description": "Enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2217403115"}, "TheFloorIsALie.udk": {"title": "The Floor Is A Lie", "author": "Pioneer", "description": "Simple map with double floor/wall/ceiling.\nRecommended with unlimited boost and either normal boost power or 1.5x boost power.\nIf you don't feel confident in your arials, I recommend to use the beach ball.\nSome rumble-items don't work through the invisible walls, others will. Still fun though. :)\n---------------------------\nWatch \n<https://www.youtube.com/watch?v=vfIIa2cUZSE>\n on how to play workshop maps. You don't need to replace/rename the map anymore, you can load it directly via the workshop folder.\nCredits to \n<https://rocketleaguemods.com/mods/udk-2015-simple-setup/>\n for providing me the necessary tools to create this map.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2217708978"}, "Narrow.udk": {"title": "Narrow heatseeker - Beckwith park", "author": "Generating play...3...2...1...", "description": "Heatseeker, but in a narrow corridor because why not?\nIf you are using rocket plugin to host the map, make sure to use Soccar as the game mode. \n**Do not use the Heatseeker mode as it breaks ball/players spawns.**\nHow to play with friends\n<https://www.youtube.com/watch?v=vfIIa2cUZSE>\nRecommended mutators\nThis is what I personally was using when hosting matches.\n1v1\n \nBall max speed: Super fast\n \nBall physics: Super light\n \nBall size: large\n \nBoost amount: Unlimited\n2v2\n \nBall max speed: Fast\n \nBall physics: Super light\n \nBall size: large\n \nBoost amount: Unlimited\n \nBall gravity: High\nIf anyone is interested in playing workshop maps with the community, including this map, feel free to join this discord that was created exactly for that! It's full of players hosting games and wanting to try new maps\n<https://discord.gg/kVGR4vB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2217837226"}, "LethFallGuys.udk": {"title": "Lethamyr's Fall Guys in Rocket League (Description)", "author": "Leth", "description": "This map will lag for quite a few people once the slime climbs up about halfway. I'm working on fixing this.\nSettings:\nUnlimited Time\nGigantic Ball\nLow Bounciness\nHeavy Ball Physics", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2218272196"}, "KegbobHoopsIX.udk": {"title": "Kegbob's Hoops IX: Evolution", "author": "Kegbob", "description": "Kebob's Hoops IX: Evolution includes 9 hoops themed maps in one.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2225194193"}, "Jungle.udk": {"title": "Dude, where's the ball?", "author": "FroYo", "description": "Rocket League in the jungle. But first you have to find the ball.\nMost fun when played with friends. I recommend using Spike Rush and unlimited boost mutators. You might also want to increase the game length a little. It can take a while to find the ball.\nHow to play custom maps with your friends.: <https://www.youtube.com/watch?v=vfIIa2cUZSE&t=418s>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2225331042"}, "LethDartBoard.udk": {"title": "Lethamyr's Dartboard", "author": "Leth", "description": "Recommended Settings:\nUnlimited Time\nBall Speed: Very Fast\nBall Physics: Super Light\nBall Bounciness: Super High\nBoost Amount: Unlimited\nBoost Strength: 1.5x", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2226953054"}, "LethHalfSize.udk": {"title": "Lethamyr's Half-Size Standard Map", "author": "Leth", "description": "Enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2228933932"}, "LethHexDrop.udk": {"title": "Lethamyr's Hex Drop", "author": "Leth", "description": "Use Rocket Plugin to load Underpass or original filename (.upk) in Dropshot mode.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2234886171"}, "Lab_Mod.udk": {"title": "Rocket Labs: Escape Game!", "author": "Ecrase-Patate", "description": "After working for months on my first mod, I am thrilled to introduce you to Rocket Labs: Escape Game!\n____\nThis mod takes place in Rocket Labs where, among other things, balls are made. You are a new recruit and your team has chosen to test your capacity to observe, explore and think. Maybe after that you will get a \"hello\" from them :)\n____\nI designed this mod as a solo experience that doesn't require mechanical skills nor friends to complete.\nI wanted to make a mod available and entertaining for anyone at any rank.\nThe time to complete this mod will vary from one to another, I aimed for 1h - 1h30\nHave fun!\nCurrent version: V10.\n____\nMULTIPLAYER\nFor now multiplayer is not fully supported, and not tested. There will be some issues if several players open the same interface for example.\n____\nSPEEDRUN\nIf you are interested in speedrunning my map, I added a timer for you. Look for the \"Speedrun\" post at your left at the beginning and follow the instructions.\n<https://www.speedrun.com/rl#Workshop_Maps>\n____\nFollow me on Twitter and Youtube:\n<https://twitter.com/EcraseP>\n<https://www.youtube.com/channel/UC1YdMPxzfcM1lLFha0rgVwQ>\nJoin my discord:\n<https://discord.gg/tvDdecu>\n____\nSpecial thanks:\nGidek\nMr. Swaggles\nBidou\nRaphouz", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2236111069"}, "garage.udk": {"title": "Garage Freeplay", "author": "Thanrek", "description": "Check out the Garage freely", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2237089354"}, "Rupture.udk": {"title": "RUPTURE - The Pit 2!", "author": "Ellbell", "description": "A Sequal to The Pit but it's better in all ways. Hope u likey! :D", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2241426142"}, "Puzzle.udk": {"title": "Trifftnix's - Finish your Puzzle", "author": "Trifftnix", "description": "An almost normal Rocket League Map. With every goal you come closer to finishing your puzzle, but it will also get harder to score the next goal. Especially because your opponent will attempt to finish his puzzle as well and if you get scored on, you will lose your hard earned pieces. - Can you finish your puzzle before the game is over?\nBig Shoutout to danfai for feedback and helping me figure out, how to get the multiplayer part working!\nYou can find all my maps in my collection: \n<https://steamcommunity.com/workshop/filedetails/?id=2310754230>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2242468953"}, "rocket_adventures.udk": {"title": "Rocket Adventures", "author": "gidek", "description": "Support me on Patreon and become my beta tester :\nwww.patreon.com/gidek: <http://www.patreon.com/gidek>\n-------------------------------------------\nWelcome to \n*Rocket Adventures*\n!\nProbably the first time you will play Rocket League in an Isometric environment, there are 20 levels to beat in this game.\nIt's not simple but not too hard, i made it quite accessible to everyone.\n[Dpad] - Skip/Change Level\n[Ballcam button] Switch near/far cameras \nJoin my discord if you have any questions, issues, or just want to discuss with me :)\n<https://discord.gg/UPVzqBP>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2244272138"}, "Kickball_V2.udk": {"title": "Rocket League Kickball!", "author": "Simple Shark", "description": "This is Rocket League kickball! Make sure to watch the how to play video above, otherwise things might be a bit confusing when you load it up.\nSettings:\n-Time:\n- 10-20 minutes if you want to have one person kick for that long and then switch and compare scores\n- Unlimited time if you want to switch back and forth\n- For Extra Spice:\n- Light ball physics\n- 1.5x boost\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2244471578"}, "NytroMiniGames.udk": {"title": "Multiplayer Mini-Games -By Evan", "author": "Evan", "description": "Thumbnail By TX: <https://www.youtube.com/channel/UCbYoXoPfSXzNXdCCmyPb9DA>\nJoin our Discord: <https://discord.gg/bF8XQEJ>\n[discord.gg]\n for additional help and to participate in our workshop events. We will be hosting the workshop map on Google servers so that anyone can join without the installation of Hamachi. Our Discord server will be the best place to find information regarding this. \nHow to play with friends:\n*Use \nBakkesMod: <https://bakkesmod.com/download.php>\n[bakkesmod.com]\n and the \nRocket Plugin: <https://bakkesplugins.com/plugins/view/26>\n[bakkesplugins.com]\n to swap the map and assign the mutators.\nHow to install plugins: <https://youtu.be/6Qc_FTDhrSs?t=105>\n*Use \nRadmin: <https://www.radmin-vpn.com/>\n[www.radmin-vpn.com]\n to join a VPN with friends and play together. \nMutators: \n          *Boost amount: Default\n          *Respawn time: Disable goal reset\n          *Match length: unlimited \n          *Demolish: Disabled \nCommon issues and solutions:\n*Content ID mismatch: Check “Joining custom map” and then select NytroMiniGames.udk\n*Wrong password: In Rocket League go to host a local lobby and delete the password before hosting.\n*Cannot connect: Host should turn off firewall for private networks. Remember to turn back on after!\n*Sky quality low: In Rocket League video settings change texture detail to high quality. ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2244509743"}, "BigHoops2k20.udk": {"title": "Big Hoops 2k20", "author": "Mr. Swaggles", "description": "Bigger is Better\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to largeness for being bigger than smallness", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2257209732"}, "RFHStadium.udk": {"title": "RFH Stadium", "author": "Mr. Swaggles", "description": "Ranked Hoops presents: RFH Stadium\nSince 2017, Ranked Hoops has been the home of competitive Hoops. Now it has an arena of its own to call home. Welcome to RFH Stadium.\nJoin the Discord: <http://discord.gg/K4FFzQU>\n[discord.gg]\nWe have awarded over $15000 in cash prizes as the longest-running weekly tournament organization in Rocket League. We have no plans of slowing down.\nAnd a profound thanks to our admins, moderators, and sponsors\n Camber\n Hrolf\n Nico\n Wolff\n MythicPinkMist\n The Sassy Pig\n BigJakk\n Wheels\n PlatymusPrime\n Mr. Swaggles\n Pengo\n RedZenin\n CMYK\n Face\n GucciDane\n CapCarrots\nAd dunktoriam\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2259822465"}, "TJBrotherXqc.udk": {"title": "xqcL", "author": "tj", "description": "", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2264298188"}, "Tron.udk": {"title": "T R 0 N", "author": "FroYo", "description": "Inspired by the classic movie scene, your car produces a ribbon of destructive light (while you try to score goals).\nMultiplayer \nThis map is meant to be played in multiplayer mode (1v1, 2v2 or 3v3). You can only get destroyed by the ribbons the opposite team leaves behind. To make it harder and to get closer to the movie scene, you can use the high gravity mutator.\nHow to play custom maps with your friends.: <https://www.youtube.com/watch?v=vfIIa2cUZSE&t=418s>\nSingle Player \nFor demonstration purposes I added a simple AI opponent (mirroring your moves) for regular singleplayer mode.\nKnown Issues \nSometimes after a goal is scored some \"ghost walls\" might  stay on the field. Couldn't figure out a solution to this problem. The replay seems to mess everything up.\nShoutout to rubenpenax and his \nreddit post: <https://www.reddit.com/r/RocketLeague/comments/jbwni5/i_might_be_crazy_but_what_about_tron_pvp_in/>\n for putting the idea out there. There actually was a little back and forth in the mapmaking discord about who gets to make it. Thanks NewkTV and Shark for letting me have this one.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2266732476"}, "Maze.udk": {"title": "The Maze (Now Completable)", "author": "Simple Shark", "description": "This was a map I made to challenge myself to make something in a weeekend. And it only took me a day and a half! So this map isn't as polished as some of the others, but I hope you can still have some fun! And yes... I took another couple days to really polish it, but I kept the original idea in tact.\nGameplay:\nFOR PLAYERS\n- If you're playing alone, I recommend taking the map with you, as soloing the maze is actually hard\n- If you're playing with a friend, (JOIN THE SAME TEAM) you don't need the map and should be able to navigate through it easily as it's really easy to do it this way\nBUG FIX\n- If you are playing with a friend, the teleporting sometimes glitches, on the same team it might teleport all of you. The person who is going through the maze should switch teams and you should be fine.\nBIRDS-EYE PLAYER\n- Don't take the ball, that's there for the birds-eye view player\n- For birds-eye view player, hit the white blocks in order to move the ball and see easier!\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2282625994"}, "LegoMap.udk": {"title": "Rocket Lego!", "author": "Mr. Swaggles", "description": "9/10 users say that this accurately represents stepping on Legos!\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to Lego for inspiring all of us as kids.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2290822390"}, "SharkPachinko.udk": {"title": "Pachinko", "author": "Simple Shark", "description": "Welcome to Rocket League Pachinko! A standard mode where every time you score, your luck is what matters! Will you end up scoring FOR your team? Or will you end up scoring ON your team? Do you even want to score? It's all in your hands in Rocket League Pachinko. Well, not all of it...\nSettings:\n- Boost Pad Visuals are currently glitched so unlimited boost is recommended to make it fair.\n- If you want normal boost or recharge you can, but only the host will be able to see the yellow part of the boost pad, but they are still operational\n- If you want RUMBLE to effect the board, just go to crazy rumble and increase the range\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2291498462"}, "SharkSpiderballV2.udk": {"title": "SpiderBall", "author": "Simple Shark", "description": " Welcome! \nWelcome to the Hardsst game-mode on the Rocket League Workshop, which I call Spiderball! A game-mode with tons of tunnels and crazy paths! This is another version of battlegrounds, but instead of going back and forth, you can go side to side!\n Gameplay \n- 4v4 game-mode* with 2 balls (Enable it in rocket launcher -> In game mods -> Ball mods)\n- DO NOT 1v1. If playing in a 2v2 or 3v3 (4v4 highly reccomended), use 1 ball\n- Unlimited Time\n- First to 3\n- Unlimited Boost\n*If you need help finding people to play custom games with, make sure to check out this server made by Balanced Waffle to find players!\n<https://discord.gg/kVGR4vB>\nP.S. Boomer Mode is really fun on this map\n GLHF! ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2298425323"}, "SharkBattlegroundsV2.udk": {"title": "Battlegrounds Remastered!", "author": "Simple Shark", "description": "Welcome to Battlegrounds Remastered! OG Idea is by Lethamyr. Me and my friend played it every week. And the OG is a great map, but is old and has a few issues. (Sorry Leth) So I Remastered it and fixed the problems that I had, and here it is!\nGameplay:\n- Unlimited Time\n- Unlimited Boost\n- First to 3 recommended\nFor Videos on all my maps before they're released, make sure to subscribe to my Youtube! (linked on the right)\nFor Updates on all of my maps and to know when I'm streaming, uploaded to Steam or Youtube, follow my Twitter! (linked to the right)\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2298425746"}, "1v1v1.udk": {"title": "Trifftnix's - 1v1v1", "author": "Trifftnix", "description": "The perfect map, when you want to battle it between three different players (1v1v1) or teams (2v2v2). Will you defend your goal and survive longer than your opponents?\nI can only recommend decorating your car according to the team colors in this map: EIther blue, yellow or red. Yellow and Red need to join orange side.\nSettings: \nUnlimited Time \nDemolish: Friendly Fire (Yellow and Red team are both in orange)\nIf you like this map, pls give it a thumbs up.\nHow to play custom maps with friends: \n<https://www.infinidim.org/playing-private-workshop-maps-matches-in-rocket-league>\n \nYou can find all my maps in my collection: \n<https://steamcommunity.com/workshop/filedetails/?id=2310754230>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2304576722"}, "SaveThePlanet.udk": {"title": "Save The Planet Challenge by Trifftnix", "author": "Trifftnix", "description": "Can you save our planet? All the balls are filled with different types of recyclable trash and you need to sort everything correctly into the proper goals. \n\tYou can play it in SINGLEPLAYER mode and try to get a highscore. What will be your best time?\n \n\tAnd of course you can play it in MULTIPLAYER with your friends and see which team is better at saving our planet and can score more points.\n \n\tRecycling was never more fun!\n \n\tRecommended Settings: Unlimited Time\n \n\tIf you like this map, pls give it a thumbs up.\n\tHow to play custom maps with friends: \n<https://www.infinidim.org/playing-private-workshop-maps-matches-in-rocket-league>\n \n\tYou can find all my maps in my collection: \n<https://steamcommunity.com/workshop/filedetails/?id=2310754230>\n \n\tBig Shoutout to Danfai and Ecrase-Patate for alpha-testing and to the guys of the community-workshop-discord BalancedWaffle, Shark, InfiniteTroll, Geneboie and Atomizer for betatesting.\n ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2325074009"}, "Park_P_Recreation.udk": {"title": "Beckwith park recreation", "author": "Generating play...3...2...1...", "description": "The goal of this map is to allow map creators to have a template which contains everything needed to create a Rocket League map.\nThe recreation is not 100% accurate as this wasn't the goal.\nRequirements\n \nUdk 2013 or 2015 (see getting started link)\n \nPark_P dummy assets: <https://drive.google.com/file/d/1Zp5_W8RmU6OQsDbBOHdUqQUhvaxg9ndb/view?usp=sharing>\n[drive.google.com]\nUseful resources\nGetting started: <https://rocketleaguemapmaking.com/essential/03_installing.html>\n[rocketleaguemapmaking.com]", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2325477336"}, "1v1v1Hexagon.udk": {"title": "1v1v1 Hexagon by Trifftnix", "author": "Trifftnix", "description": "Several people gave the same feedback, so that's why you can play a 1v1v1 now in Hexagonshape.\n \n\tThe perfect map, when you want to battle it between three different players (1v1v1) or teams (2v2v2). Will you defend your goal and survive longer than your opponents?\nI can only recommend decorating your car according to the team colors in this map: EIther blue, yellow or red. Yellow and Red need to join orange side.\nSettings: \nUnlimited Time \nDemolish: Friendly Fire (Yellow and Red team are both in orange)\nIf you like this map, pls give it a thumbs up.\nHow to play custom maps with friends: \n<https://www.infinidim.org/playing-private-workshop-maps-matches-in-rocket-league>\n \nYou can find all my maps in my collection: \n<https://steamcommunity.com/workshop/filedetails/?id=2310754230>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2329319460"}, "SwaggysWorkshop.udk": {"title": "Swaggy's Workshop", "author": "Mr. Swaggles", "description": "Wish you were here\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to Santa Claus for being an epic dude", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2333452229"}, "FeshkysCeilingGoales.udk": {"title": "Feshkys Ceiling Goals", "author": "feshky", "description": "The goals are in the ceiling.. good luck!\nRecommended to be played with boomer mode and rumble!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2345189859"}, "TheCube.udk": {"title": "The Cube", "author": "Wlaput", "description": "Rotating 3D maze with a puzzle. Solve the puzzle to find the exit.\nRecommended settings:\nEnable freeplay\nCam Distance: 200\nCam Angle:      0\nIt is a challenge with a prize pool.\nFor more infos about the challenge: \n<https://youtu.be/u1mM1Xdw8n4>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2345341086"}, "Island.udk": {"title": "Mapmaker's Island", "author": "FroYo", "description": "A place, where you can explore, hang out at the skatepark, fly through some rings, spawn yourself a few protesters or try your luck at the casino.\nHave fun.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2346109201"}, "testy.udk": {"title": "Hard Parkour Map (RE UPLOADED)", "author": "InfectiousIwan", "description": "A hard parkour map, no checkpoints. Play with no boost. I have now fixed the issue of certain blocks not spawning.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2347104517"}, "AmongUs.udk": {"title": "Among Us in Rocket League", "author": "gidek", "description": "A fully working game of Among Us in Rocket League! \nCreated by gidek & Lethamyr with the help of CinderBlock for the bakkesmod plugin.\n**Bakkesmod Plugin required to play:**\n \n<https://bakkesplugins.com/plugins/view/166>\nHow to Play Custom Maps with Friends: \n<https://www.youtube.com/watch?v=vfIIa2cUZSE>\n**What's in this map ?**\nEvery aspects of the orignal Among Us game were remade for this map including:\n- Tasks\n- Votes\n- Kills/Reports\n- Sabotages\n- Vents\n- Cameras\n- Settings\n&more\n**Features :**\n- \n**Camera View :**\n The host can choose if you want to play with the Among Us bird's eye view or with the RL car camera in the settings.\n- \n**Spectator Mode :**\n When a player a dies, his remaining tasks will auto-complete with a delay to simulate ghosts while he can enjoy watching the game and stealing Impostors strats :D\n- \n**Tactical Map :**\n During Votes, you have the ability to open a map and place a pin point to give your position to other players. The reporting player can also select the dead body and place it on the map.\n- \n**Show Other Impostor On Map :**\n This new setting can be set to <AdminMap>, impostors will see where their impostor mate is on the admin map. Also can be set to <Always> to display it on the basic blue map or <Never> like the original game.\n__How to play :__\nIt is very recommended to play with your keyboard and mouse.\n<Space> key is used for actions (ballcam default button)\n<R> key to open the map (rumble default button)\nUse your mouse to click on UI buttons and to complete tasks.\nRules are the same as in Among Us, you probably know them already but if you don't, go check some wikis!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2347189620"}, "ice.udk": {"title": "Ice Ice Outpost - MKRL", "author": "Thanrek", "description": "Ice Ice Outpost is the second map in a series of maps I'm making.\nFrom now on, I will only take .ghost files as proof for new runs on the leaderboards, send me your files \non twitter: <http://www.twitter.com/platypun>\n or on \nreddit: <https://reddit.com/u/thanrek>\nYou can download Ghost Plugin here to record and share your ghosts : \n<https://bakkesplugins.com/plugins/view/174>\nCurrent World Records (with included timer) :\n1-Lap Glitchless :\n \n \nRanks\n \nTime\n \nUsername\n \n \n \n1st\n \n00:24:178\n \nKittenDuck8: <https://www.youtube.com/watch?v=X9U5L91IvJI&feature=youtu.be>\n \n \n \n2nd\n \n00:24:178\n \nCookie: <https://www.youtube.com/watch?v=1m0TsiHThZU&feature=youtu.be>\n \n \n \n3rd\n \n00:25:290\n \njaay: <https://twitter.com/jaay_rl/status/1351604156423921668?s=20>\n \n3-Laps Glitchless :\n \n \nRanks\n \nTime\n \nUsername\n \n \n \n1st\n \n01:18:175\n \nCookie: <https://www.youtube.com/watch?v=EQWXf-0nKl0&feature=youtu.be>\n \n \n \n2nd\n \n01:19:212\n \nKittenDuck8: <https://www.twitch.tv/videos/866715523>\n[www.twitch.tv]\n \n \n \n3rd\n \n01:22:842\n \nThanrek\n \nIMPORTANT INFO :\n!!!\n You will need these additional files for all the textures to work properly: <https://rocketleaguemods.com/mods/workshop-textures/>\n[rocketleaguemods.com]\n \nYou can also get them from this link: <https://drive.google.com/file/d/1jklpjfEu4Yw97cjYaMDWRx8H2XFyji6U/view?usp=sharing>\n[drive.google.com]\n!!!\nThe map includes automatic respawn and timer/lap counter when played in singleplayer, custom UI and a minimap.\nContact : thanrek [ at ] \ngmail.com: <http://gmail.com>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2348278106"}, "psychodegenerator_10.udk": {"title": "Psych-Tronics", "author": "Evan", "description": "This is psychotic!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2352953261"}, "RocketLeagueGym.udk": {"title": "RocketLeagueGym", "author": "ruhflz", "description": "This map is in it's VERY early stages but im uploading for the sake of getting friends to test", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2356314869"}, "gpeppersRings.udk": {"title": "gpepper's Rings - 1 - v1.1", "author": "gpepper", "description": "Prototype version, more to come, check back for new updates!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2356338428"}, "LethParkourEgypt.udk": {"title": "Lethamyr's EgyptianTomb", "author": "Apofoo", "description": "**Map created by Lethamyr**\n (I am not the Creator, i just uploaded it)\nDescription\nI \n**(Lethamyr)**\n created an entire Egyptian Tomb adventure map inside Rocket League! Beware, as this map is very difficult! Boost is not allowed. The best experience is with friends online. The ankhs are optional, but if you manage to get all 30, something special awaits you…\nRecommended Settings\n**Boost:**\n No Boost\n**Time:**\n Unlimited\n**Respawn Time:**\n 1 Second (helps make respawns faster)\nMissing textures\n Search \"workshop-textures\" on Rocket League Mods", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2360666722"}, "SharkDominationRemasteredOG.udk": {"title": "Domination: Remastered", "author": "Simple Shark", "description": " Welcome! \nWelcome to Rocket League Domination! Make sure to watch the How-to-Play Video above to see how the gameplay works, and about the Domination Tournament!\n Gameplay! \nPhase 1: Ball spawns at a random location around the map\nPhase 2: A player grabs the ball and the scoreboard starts counting. First to 190 points wins!\nPhase 3: Ball gets destroyed by either the other team taking it or a player is demoed.\nPhases Repeat!\n Tournament \nA 3v3 tournament is happening on this map on 1/23. If you would like to learn details and to register, join the \n Community Workshop Games Server!: <https://discord.gg/KVgmf9JFpZ>\n[discord.gg]\n (Epic and Steam allowed.) Make sure to tell your friends about it! We want to bring more attention to community games and give everyone a chance to join!\n Mutators \n Turn off Dynamic Shadows in Video Settings. Otherwise, your car will appear black for some reason\n Time Limit: Unlimited Time\n Max Score: 1 Goal\n Boost Amount: Unlimited\n Rumble: Spike Rush\n Respawn Time: 1 Second\n Fun Facts to beat your opponent \n There are 9 total spawn locations. The ball will cycle through every single one before restarting the cycle.\n The No Gravity Room (The Wooden Egg) has shields on it, but these shields have nothing to do with scoring. They are just there for visual purposes\n There is an invisible ceiling above the bordering rock, and it will not destroy the ball\n There are 4 buildings on the map in which you can drive up the walls\n \n The 2 places with Black Hexagons\n \n The Middle Red Brick Building (The one with the lava)\n \n The No Gravity Room\n GLHF! ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2361010007"}, "SharkRouletteV4.udk": {"title": "Rocket League Roulette!", "author": "Simple Shark", "description": " Welcome! \nWelcome to Rocket League Roulette! Make sure to watch the quick How-to-Play video above! I like to be visual with explanations, as I'm not very good at explaining things.\n Gameplay \nYou spawn and then get onto the colored square that you would want to bet on. Only one person per square!. The ball spins and If it's your color, you survive. If it's not your color, you get demoed and If you get demoed your team loses a life. You bet on a color again, and the cycle continues. \n Different ways to play \n The first team to lose all their lives loses! Check the chart below to see the recommended amount of lives per team depending on player count!\n \n \n# of Players\n \nLives to each team\n \n \n \n2\n \n5\n \n \n \n4\n \n10\n \n \n \n6\n \n15\n \n The team with the most lives at the end of 10 minutes wins!\n The first individual to lose all their lives loses! Check the chart below to see the recommended amount of lives per team depending on player count!\n \n \n# of Players\n \nLives to each team\n \n \n \n2\n \n5\n \n \n \n4\n \n5\n \n \n \n6\n \n5\n \n The Individual with the most lives at the end of the 10 minutes wins!\n Mutators \nMatch Length: Unlimited\nBall Physics: Super Light\nBoost Amount: Unlimited\nGravity: High\nDemolish: Disabled\n** Rumble: You could do Haymaker only and punch the ball as it spins around!\n GLHF! ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2362950751"}, "McSpikeBall.udk": {"title": "Spikeball Arena", "author": "McShredder", "description": "This map is a Rocket League version of the game Spikeball. This game can be played with 2-6 players. The objective of the game is to score the most goals on the opposing team's goal. Both teams can utilize the trampoline in the center of the arena by either jumping on it or bouncing the ball off of it. In order to setup multiplayer, use the Rocket Plugin for Bakkes Mod. The game is meant to be played with unlimited boost and default mutator settings for everything else, but feel free to have fun with it. Tips: Use the center ramp to get in the air quickly from the ground while conserving a flip; Land on the trampoline with all 4 tires to get the best bounce and conserve a flip; Hit down on the ball into the trampoline to bounce it higher; Recover from falling quickly by boosting fast towards the trampoline.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2363050395"}, "BeachVolleyNight.udk": {"title": "Salty Shore (night) - Beach Volley", "author": "Generating play...3...2...1...", "description": "Field made by \nDerzo: <https://steamcommunity.com/id/DerzoDev/myworkshopfiles/>\n.\nEver wanted to play the beach ball limited time mode the way it was meant to be played? Wait no more!\n**Use the required and recommended mutators for the best gameplay**\nVolleyball plugin (host only)\nI created a bakkesmod plugin specifically for this map. This allows for an optimal gameplay.\nVolleyball plugin: <https://bakkesplugins.com/plugins/view/175>\n[bakkesplugins.com]\nRequired mutators\nBall size: Medium\nBoost amount: Unlimited\nRecommended mutators\nMatch length: Unlimited*\nBall type: Beach ball\nBall physics: Light\nRespawn time: Disable goal reset\n*Host requires the BeachVolley plugin to play with a score limit instead of a time limit\nRecommended volleyball plugin settings\nEnable volleyball plugin: checked\nScore to win: Whatever you prefer\nEnable overtime: checked\nBall gravity: 0.650\nDecrease the ball gravity if it's too hard to hit the ball in time.\nHow to play custom maps with friends\nThanks Lethamyr for this simple to follow tutorial.\n<https://lethamyr.com/set-up-custom-maps>\nIf anyone is interested in playing workshop maps with the community, including this map, feel free to join this discord that was created exactly for that! It's full of players hosting games and wanting to try new maps\n<https://discord.gg/kVGR4vB>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2365220325"}, "Shark90Degrees.udk": {"title": "Sideways Standard Map!", "author": "Simple Shark", "description": "What have I done... I flipped the standard field 90 degrees and I regret everything. There are a list of sets of mutators that you can do below.\nMutator Options: \n Gravity: Low\n Boost: Not Default\n Gravity: None (Enable in bakkesmod 'Current Game' Tab)\n Boost: Unlimited\n Boost Strength: 1.5x\n Boomer Mode\n Rumble: Any\n Boost: Slow Recharge\nGLHF! If you can", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2369473228"}, "SharkDecaBall.udk": {"title": "Deca-Ball", "author": "Simple Shark", "description": "Welcome to Rocket League Deca-Ball! Another battlegrounds-ish variation where you have to score in all 5 goals in order to win!\nGameplay:\nOnce the game starts, score in all 5 goals to get a point! You can track your progress with the in-game HUD in the bottom left. Blue scores on Orange and Orange scores on Blue. Once you score on a goal, a gate will close to show that that goal has been scored on. You have to actually put the ball in the goal in order to score, rolling it on the edge will do nothing. The Gates do not have collision. (I tried for months, and if they had collision it would drop your fps to 15)\nMutators:\n- Turn off Dynamic Shadows in video settings\n- Time Limit: Unlimited\n- Max Score: 3 recommended (This dictates how long the game is)\n- Boost Amount: Unlimited, OR Recharge for a challenge\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2374180317"}, "SharkDisadvantages.udk": {"title": "Disadvantages: Where Plats beat SSLs", "author": "Simple Shark", "description": "Welcome to Rocket League Disadvantages, the place where lower leveled players can beat higher leveled players. You've seen those videos of \"6 Plats vs. 1 Grand Champ\". And this map is built around that premise! \nGameplay:\nEveryone who's on Orange will have a ton of disadvantages and everyone on Blue just plays normally. There are 10 Unique Events that can happen to Orange that will happen every 5 or so seconds. There is an extremely rare occurrence where something might not happen for some reason. Just rejoin teams and it'll fix itself. \nIf you are the same rank, offset the teams. So 3v1 with 3 on orange or 2v1 with 2 on Orange etc.\nMutators: This is a standard map, but disabling demoes makes gameplay a lot more fun and a lot smoother. Don't worry I'll demo Orange plenty \nDemolition: Disabled\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2380370578"}, "SharkPit.udk": {"title": "The Pit", "author": "Simple Shark", "description": "Welcome to the pit,  a small map I made in a day which slants toward the center. In the center there's a lava pit, so watch out!\nGameplay:\nIt's a standard map, so just score in the goals. The lava pit in the middle will kill you, but will not harm the ball.\nMutators:\nBoost: Recharge (Fast) or Unlimited\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2380642806"}, "GetLostTheybjoy.udk": {"title": "Get Lost!", "author": "Rocket League Mapmaking", "description": "A maze where to the ball is spawned at a random location and you have to find it. If you find the ball more number of times than your opponent, you win!.\n    Make sure to disable goal reset (MUST) as a mutator and you can add unlimited boost as well", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2383610607"}, "AirDribbleMeleeFenixDFix.udk": {"title": "Air Dribble Melee - No Defensive Spawns", "author": "FenixD", "description": "Original Map by TJ modified to exclude defensive spawns. \nI claim no ownership or credit for the original works. I merely modified the blueprints to exclude the spawns and changed the rotation on level#7. \nLink to original below:\n<https://steamcommunity.com/sharedfiles/filedetails/?id=2215294712>\nSupport the original creator by using the links below \nPatreon: \n<https://www.patreon.com/tjbrother>\nTwitch: \n<https://twitch.tv/tjbrother>\nTwitter: \n<https://twitter.com/tjbrotherlive>\nMy personal Twitch:\n<https://www.twitch.tv/fenixd_uk>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2383877804"}, "Portal_Park.udk": {"title": "Portal Park - Athena's doom", "author": "Llamalectric", "description": "My first map! :) \nAnnouncement video: \n<https://youtu.be/y9KThyxFzRk>\n# What this map is:\n   A standard map with portals on both backboards that connect to each other. \n   You can have fun making cool passes from the other side of the field by making the ball go in or flying in yourself.\n   It's called \"Athena's doom\" because if you Athena flick, the ball goes through a portal making it easy for the other team to score.\n# Recommended settings:\n   Boomer mode to get more touches on the backboard. \n   Here are the settings for reference:\n      Ball Speed - Fast\n      Ball Physics - Super Light\n      Ball Bounce - Super High\n      Boost Amount - Unlimited\n      Boost Strength - 1.5x\nIf you find any bugs tell me in the map comments.\nThank you nityammm for the idea.\nIf you want to make maps, get started here: \n<https://discord.gg/DR4Z4smdR9>\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2390978140"}, "SharkAlphabet.udk": {"title": "The Alphabet", "author": "Simple Shark", "description": "Welcome to the Alphabet! 26 Arenas for 26 letters, every single letter has 2 goals and one ball. Once you score in one letter, you move onto the next and then once you go through all 26 letters, you start over at the letter A.\nAs of 2/21/2021 there is a bug with Rocket Plugin and it not correctly loading workshop maps. If you intend to play any workshop map, it is recommended to replace underpass instead. For some reason, if you don't you won't be able to play the letters X,Y, or Z. \nTurn off Dynamic Shadows in Video Settings. This map has weird lighting to ensure that everything is properly lit, but will cause weird shadows to happen with your car\nMutators:\n- Time: Unlimited\n- Boost Amount: Unlimited\nBoomer and Rumble are two fun modes that will make it a lot easier. However, I highly recommend you play it normally first.\nDO NOT change the score with Match Admin, This will cause the game to skip 2 letters.\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2391262274"}, "RocketLabsDunk.udk": {"title": "Rocket Labs Dunk", "author": "Mr. Swaggles", "description": "Definitely a real Labs map\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to Rocket League for having a rad style worth, uh... \n*borrowing*", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2392406952"}, "RocketLabsFlex.udk": {"title": "Rocket Labs Flex", "author": "Mr. Swaggles", "description": "Flex on em\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to Pringles for subconsciously inspiring the shape of this map.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2394624125"}, "Round-Fort.udk": {"title": "Round Fort", "author": "Zuratu", "description": "If the standard RL arena and Block Fort from Mario Kart had a baby", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2399058624"}, "SharkBridge.udk": {"title": "The Bridge", "author": "Simple Shark", "description": "Welcome to the Bridge! A game-mode where you play on a bridge and score in the goals provided. Watch out for the water!\nGameplay:\nIt's a standard-ish map so all you have to do is score in the goals! There is boost on the bridge and along with this, falling in the water will regenerate your boost! It will also make you float :)\nMutators:\nNone\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2401839195"}, "SharkCameras.udk": {"title": "Cameras Everywhere!", "author": "Simple Shark", "description": "Welcome to Cameras! A game-mode that will set your camera around the map instead of behind your car!\nGameplay:\nThere are 9 cameras placed around the standard rocket league map. The game will start with a birds-eye-view and then rotate through the other views. At the beginning of every kickoff it resets at birds-eye view. In other words it's a set rotation, because it plays better this way. If someone gets demoed, their camera will be normal until the next cycle so be careful where you're going! \nMutators: It's a standard map with working boost pads, but without unlimited boost it becomes 100x harder\nTurn off Shadows in Video Settings, I will have it fixed for the next maps\n- Unlimited Boost\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2401873065"}, "RocketLabsGalleyOops.udk": {"title": "Rocket Labs Galley-Oops", "author": "Mr. Swaggles", "description": "Arrr\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to the Ranked Hoops squad, theAGW, mangeybum, Kegbob, and the entire Hoops community!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2401893143"}, "KegbobHoopsIXRevolution.udk": {"title": "Kegbob's Hoops IX: Revolution", "author": "Kegbob", "description": "Kebob's Hoops IX Revolution is a remix on the original 9 maps. This an an Alpha Version. Enjoy.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2403044588"}, "TrainingShop.udk": {"title": "TrainingShop", "author": "Salad", "description": "This is my first public workshop map. This is for training mechanics like backboard resets, chains, and air dribbles.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2407163881"}, "Ellipse.udk": {"title": "Ellipse", "author": "Zuratu", "description": "No corner, all wall. It's like the standard arena but elliptical.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2410114473"}, "Llamabooststarve.udk": {"title": "Boost Starve", "author": "Llamalectric", "description": "A map for boost management practice.\nBoost pads give 1 boost and pills give 12.\nMake sure to disable \"Unlimited Boost in free play\" if you're playing alone.\nIf you find any bugs, please tell me in the map comments.\nSubscribe to my youtube - \n<https://youtube.com/channel/UC1x--mKaxJG3yVLf6PX34Aw?sub_confirmation=1>\nIf you want to make maps, get started here: \n<https://discord.gg/DR4Z4smdR9>\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2413082787"}, "SharkDonut.udk": {"title": "The Donut", "author": "Simple Shark", "description": "Welcome to the Donut! This is a map where you play in a donut. Or as I like to think of it, a Rocket League NASCAR track with a ball and goals.\nGameplay:\nThe Goals are located on the inside of the donut. They are connected and you can drive through to the other side of the donut quickly this way. However, the ball cannot travel through as it will be scored.\nMutators:\nTurn off Shadows and if its too bright, Bloom in video settings.\nBoost Amount: Unlimited\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2420225092"}, "SharkBathTub.udk": {"title": "The Bath Tub", "author": "Simple Shark", "description": "Welcome to the Bath Tub, where the entire map is shaped like a Bath Tub! This map is super good for air dribbles and you'll see why!\nGameplay:\nThe field is shaped like a bathtub, the goals are on the top. The indent of the tub is one full field in height, so you have to air dribble every ball out! Unless you can hit a pinch that goes the height of two rocket league fields. If you need help getting it out, consider putting on Boomer, Rumble, Low Gravity or another mode like that.\nMutators:\nBoost: Unlimited\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2426031652"}, "LlamaDoubleDecker.udk": {"title": "Double Decker", "author": "Llamalectric", "description": "A standard map with 2 Floors.\nYou can either use unlimited boost or regular, but I recommend regular.\nIf you find any bugs, please tell me in the map comments.\nIf you like this map, you can subscribe to my youtube here: \n<https://www.youtube.com/channel/UC1x--mKaxJG3yVLf6PX34Aw?sub_confirmation=1>\nFun Fact: No materials in this map are from urban central!\nThank You to Mr. Swaggles, this map wouldn't have existed without all of his help.\nIf you want to make maps, get started here: \n<https://discord.gg/DR4Z4smdR9>\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2426130549"}, "BeadMaze.udk": {"title": "Wire Bead Maze Thing", "author": "Mr. Swaggles", "description": "Now you can wait for the doctor as a kid... in Rocket League\n🎱 Join the official \nRanked Wire Bead Maze Thing Discord: <https://discord.gg/hffYBT3DNv>\n[discord.gg]\n for top-tier competitive action! 🎱\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to the admin team at RWBMT - RJSaurus, Tredz, and GroovyUnicyclist!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2434052873"}, "SharkABumps.udk": {"title": "A-Bumps", "author": "Simple Shark", "description": "Welcome to A-Bumps, a map where the entire thing is shaped like AAAAA! It's another battlegrounds variation, but this one is just pain.\nGameplay:\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\nMutators:\nTime: Unlimited\nBoost: Unlimited\nMax Goal Score: 1,3 Goals\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2437745355"}, "SharkWeWereHere.udk": {"title": "We Were Here: RL Edition | A Co-op Puzzle Game", "author": "Simple Shark", "description": "Welcome to We Were Here in Rocket League! We Were Here is a cooperative puzzle game in which the two players have to work together in order to get to the end! And that's exactly what this is, just the puzzles are harder and incorporate Rocket League mechanics!\n Thank you to all the beta-testers \nThank you to all the beta testers who helped me with this map! Without you, this wouldn't have been possible. Thank you to...\n- Crysys_Beatbox\n- SparrowHawk\n- Naoki\n- AshyLarry\n- Jaevion\n- Atomizer\n- Whiffing Pro\n- Mr. Swaggles\n- Balanced Waffle\n Gameplay \nWhen you load into the game, you should be looking at a black screen. This is normal, and is done in order to give the map time to load. At the beginning of the game, you decide which role you would like to play, the librarian or the explorer. There can only be 2 people in the game, more than this or any spectators causes the map to break. The Explorer is blue and the Librarian is Orange. Both Players must work together in order to solve all of the puzzles and reach the end to discover 2 different endings and a bonus ending!\n Needed before starting \nThere are a few things you need in order to run this map. You need both the \n Workshop Textures : <https://drive.google.com/drive/folders/1bmcP_N61ejUtCB-fC_gGY0vvQkaqjveX?usp=sharing>\n[drive.google.com]\n and \n Netcode Plugin : <https://bakkesplugins.com/plugins/view/166>\n[bakkesplugins.com]\n. Without these, this map will not run.\n Mutators \nTurn off \n** Bloom **\n in Video Settings (Shadows are fine, but might make your car darker than usual). Most of the textures in this map were custom made, and with bloom on, it makes them hard to see.\nMatch Length: Unlimited\nBoost: Unlimited\nDemolish: Disabled\n READ BEFORE PLAYING \nThere are a few things I need to mention before you get into the map so you're not confused.\n- The map must be launched with Rocket Plugin, this is the only way NetCode works\n- The doors don't have collision to prevent massive frame rate issues and sometimes you could go through them, so they will instead teleport you away from them.\n- You can play this map multiple times. Every single sequence is randomized and has variations. A duplicate variation is purely coincidental.\n- WARNING: You will not be able to save replays. Teleporting a player crashes the replays and this action is crucial to the workings of this map. Also, a replay over 30 minutes long tends to crash the game.\n- If you want to replay this map, restart from kickoff in match admin doesn't work. You will need to make a new lobby\n ONLY HOVER OVER THE BLACK BAR IF YOU HAVE COMPLETED THE GAME \nThe following is a spoiler: \n In the ending cutscene, one of the lines is, \"Was this sacrifice necessary?\" The answer to that question is \n** no **\n. There is a way to get both players through the gate at the end. \n GLHF! ", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2442358440"}, "BeadMaze_1v1.udk": {"title": "Wire Bead Maze Thing - 1v1", "author": "Mr. Swaggles", "description": "Wire Bead Maze 1v1 Ladder Map\n🎱 Join the official \nRanked Wire Bead Maze Thing Discord: <https://discord.gg/hffYBT3DNv>\n[discord.gg]\n for top-tier competitive action! 🎱\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to the admin team at RWBMT - RJSaurus, Tredz, and GroovyUnicyclist!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2443012627"}, "LilHoops.udk": {"title": "Lil Hoops", "author": "Mr. Swaggles", "description": "Itty Bitty Hoops!\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to the Ranked Hoops community for being so supportive!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2443116879"}, "SharkShoe.udk": {"title": "I'll Shoe you a Good Time", "author": "Simple Shark", "description": "I'll shoe you a good time on this map to celebrate the eating of 2 shoes. If you want to see the videos of Balanced Waffle and Sunless Khan eating their shoes, copy the link below into a search bar to view them! (For some reason the embed didn't work)\nCONTEXT: \nBalanced Waffle said he'd eat a shoe if I reached 1k subscribers by May.\nSunless Khan said he'd eat a shoe if Lethamyr reached 1 mil subscribers by Match 31st.\n<https://twitter.com/BalancedWaffle/status/1377727154734137344>\n<https://twitter.com/SunlessKhan/status/1377351924127653888>\nGameplay:\nThe shoe has two goals, one in the toe and one in the top. The one in the toe gives you 1 point, while the one on top gives you 3.\nMutators:\nBoost: Unlimited\nGoal Max Score: 3,5, or 7\nThis map is huge, so game modes to make it more exciting are Boomer, 2 Second Spring Loaded, Low Gravity, etc.\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2443378158"}, "2oops.udk": {"title": "2oops", "author": "Mr. Swaggles", "description": "2oops\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 Want \n**top-tier Hoops action?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to Camber for making Floops a reality, and to the Ranked Hoops community for being so supportive of this map!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2443382871"}, "SharkRacingSumo.udk": {"title": "Racing Sumo", "author": "Simple Shark", "description": "Racing Sumo is a Sumo map in which you have to bump each other off on a race track! This Sumo map is unique because it will automatically tally up your score as you play!\nGameplay:\nThis map is a sumo map. The goal of a sumo map is to bump everyone else off the track and to be the last one standing! The thing unique about this sumo map is that it will automatically tally your teams score on the scoreboard! No need for the host to go into match admin and change everything. Once one team gets out, it checks how many people on the other team are still on the track. The more people alive, the more points you get. (If there's 2 people alive you get 2 points, if there's 3, you get 3 points, etc.) First team to reach the final score wins!\nMutators:\nTime: Unlimited\nBoost: Slow Recharge\nRespawn Time: 1 second\nGravity: Low\nDemolish: Disabled\nBoost Strength: 10x\nGLHF!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2449133465"}, "Floops2.udk": {"title": "Floops 2", "author": "Mr. Swaggles", "description": "Get your Floops On!\nRecommended settings: \n**Unlimited boost, basketball, everyone on Blue team**\n📍 Want to \n**make maps?**\n Join the \nMapmaking Discord!: <https://discord.gg/PWu3ZWa>\n[discord.gg]\n 📍\n🎮 Want to \n**play custom maps?**\n Join the \nCommunity Workshop Games Discord!: <https://discord.gg/WNfN5ky>\n[discord.gg]\n 🎮\n🏀 \n**Where is Floops 1, you ask?**\n Join the \nRanked Hoops Discord!: <https://discord.gg/vvtk8Rz>\n[discord.gg]\n 🏀\nShoutout to Cambro for making Floops 1, and Wheelsy for the amazing thumbnail!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=2451144632"}, "Leth2Fort.udk": {"title": "2Fort", "author": "Lethamyr", "description": "A re-creation of 2Fort from Team Fortress 2 inside Rocket League. Hide n Seek map!"}, "WaterPolo_P_v1.udk": {"title": "Water Polo v1.0", "author": "glhglh", "description": "Update by Lethamyr: \n<https://steamcommunity.com/sharedfiles/filedetails/?id=1681397558&searchtext=water>\nA simple water polo map, with water!\nNOTE: This was made for exibition, not for training so is currently not supported by the workshop update :( For now you can just try it out (if the ball doesn't spawn, use the ball reset). Also, support files are not working at the moment either, so sorry for the poor visuals!\n---------------------------------------------------------------------------------------------------------------\nWater Polo in Rocket League, with custom water physics!\nGame Mechanics:\nBoost refills constantly (slowly), but refills faster in the water.\nBoost refills to 100% percent when hitting the water.\nBoost is more powerful underwater. Walls are slightly less sticky under water.\nBoost time for full boost is 20% longer, but only activates after the first goal (minor bug).\nDodge/jump resets when either entering or exiting the water. \nDodge/jump reset timer is infinite so you can use your flip no matter how long you have been in the air.\nWater Physics:\nMax speed in the water is set to around 2000uu which is slightly below supersonic, but the boost is faster so you can enter supersonic the second you leave the water. It allows for much more control whilst in the water (to the point that I can dribble the ball in the water, and I am not even that good!).\n'Water' is a gravity volume flipped upside down (650m/s, the opposite of RL gravity)\nWhilst in the water, the velocity is reduced on the car in all directions by 2%, 20 times a second. This causes the drag (but I do need feedback on this!)\nWhen the car enters the water, the angle of entry is calculated, converted to a percentage and applied to the velocity within some boundaries. Anything over a '80% perfect dive', so the middle 36°, will not affect the velocity. Anything below a '60% perfect dive', so the angles outside of the 54° range either side, will slow the car by 40% in the z-axis. The angles in between these values will use the percentage as a multiplier for the velocity so a '70% percent perfect dive' will slow the car by 30%. This works whether the nose of the back of the car enters first. (Sorry for the confusing description! Just ask if it is not clear).\nThis is my first map of any kind, so I would appreciate as much feedback as possible. \nPlanned updates:\nTweak water - more drag? Slow rotation of ball (Thanks FerrumVulpes for the idea)\nAdd ball skipping/skimming\nBoats...?\nKnown Bugs:\nSpawns sometime put you on the wrong side\nBoost length increase only activated after first goal.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814146954"}, "castle.udk": {"title": "Castle", "author": "Thanrek", "description": "A WIP Castle standard map.\n (with FIXED SPAWN)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814148760"}, "aerial.udk": {"title": "Aerial Training", "author": "Thanrek", "description": "A map to learn how to control your car including 12 levels to beat (and elevators !).\n (with FIXED SPAWN)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814164094"}, "ObstacleCourse1.udk": {"title": "Obstacle Course 1", "author": "French Fries", "description": "A series of flying obstacle challenges - Made by French Fries\nTo play the map:\nHit subscribe =>\nlaunch rocket league =>\ngo to extras =>\nworkshop and selec the map\nAs far as i'm aware it only works on PC\nIf you are interested follow me on twitter ( \n<https://twitter.com/FrenchFriesRL>\n ) \nor twitch ( \n<https://www.twitch.tv/frenchfriesrl>\n )", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814207936"}, "Dribbling.udk": {"title": "Dribbling Challenge 1.2", "author": "French Fries", "description": "French Fries presents the first map in the Dribbling Challenge Series. \nIf any textures appear black make sure to download and follow the instructions from \n<https://rocketleaguemods.com/mods/textures-for-maps-and-sticky-walls/>\n \nIf you are interested follow me on twitter ( \n<https://twitter.com/FrenchFriesRL>\n ) \nor twitch ( \n<https://www.twitch.tv/frenchfriesrl>\n ) \nDonations are by no means necessary however anything spared would help encourage me to make more. \nIf you do want to help me out you can at \n<https://streamlabs.com/frenchfriesrl>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814218628"}, "RLTrainerMap.udk": {"title": "RL Trainer Map (NEW UPDATE!)", "author": "South", "description": "This map will help you train certain aspects of the game. Still a work in progress.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814219666"}, "ObstacleCourse2.udk": {"title": "The Wall", "author": "French Fries", "description": "Race through a series of obstacles in each level faster than 'the wall' that chases you. If you get hit, the level will restart\nAlso if there are any black textures go to (THIS WILL ALSO MAKE THE WALLS STICKY WHICH YOU NEED)\n<https://rocketleaguemods.com/mods/textures-for-maps/>\nand follow the instructions\nIf you are interested follow me on twitter ( \n<https://twitter.com/FrenchFriesRL>\n ) \nor twitch ( \n<https://www.twitch.tv/frenchfriesrl>\n ) \nHope you enjoy!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814263405"}, "DesertPark.udk": {"title": "Desert Park", "author": "Miko", "description": "Desert themed park that has some aerial courses, skatepark and other cool stuff.\nAlso check out the night version!\n<http://steamcommunity.com/sharedfiles/filedetails/?id=815273262>\nplease leave a like if u want to see more!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814423462"}, "Simplicity_v5.udk": {"title": "Simplicity v5.0", "author": "Mr. Swaggles", "description": "A reconstruction of the default map with only the default texture and no scenery\n2020 Update!\n- Added boosts\n- Added correct spawns\n- Map works in multiplayer\n- Moved secret command room", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=814858208"}, "DesertParkNight.udk": {"title": "Desert Park Night", "author": "Miko", "description": "night version\n!!! IMPORTANT !!! \nSTEP 1: Download these files \n<https://www.dropbox.com/sh/1ytg63r3kt1gxag/AAAtWOZXDeA5mY-0igutYeIga?dl=0#>\n \nSTEP 2: Put the files in to C:\\Program Files (x86)\\Steam\\steamapps\\common\\rocketleague\\TAGame\\CookedPCConsole folder or where ever your RL CookedPCConsole is. \nSTEP 3: After that the textures should work. \n!!! IMPORTANT !!!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=815273262"}, "JetCarStuntsRL.udk": {"title": "Jet Car Stunts | Rocket League Edition", "author": "pnage", "description": "UPDATED VERSION: We fixed the checkpoints and we also added the timer!\nJet Car Stunts (JCS) is a console and iOS game with mechanics similar to Rocket League but with car platforming/parkour, and in this custom map we decided to make a race level in Rocket League with the JCS theme. \nThe yellow and black triangles along the course represent checkpoints which also refill your boost in the original game, and we also implemented that in our level. \nPLEASE DOWNLOAD THE REQUIRED TEXTURES IN ORDER TO SEE THE GAME CORRECTLY \nDownload and instructions: \n<https://rocketleaguemods.com/mods/textures-for-jet-car-stunts-and-sticky-walls/>\n \nCreated by Live Dimensions and Pnage \nIf you want to play without boost you must install it in the way original modding way, which is explained in this link: \n<https://rocketleaguemods.com/mods/jet-car-stunts-rocket-league-edition/>\nThe original map was designed to play without unlimited boost, that forces you to go through pretty much every checkpoint since they restore your boost... But Psyonix wont let us choose the game mode :P\nTHIS IS WHY YOU CAN EASILY CHEAT", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=815783552"}, "Headlight.udk": {"title": "Headlight Template", "author": "CaptainProton42", "description": "A simple template for adding headlights to your car using kismet whenever the car is reset.\nProbably not the best way to do it though, since I'm still new to mapping. But something fun and maybe even useful I stumbled upon.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=815993954"}, "Rlhannahsplayground.udk": {"title": "Hannah's playground", "author": "Hannah", "description": "Hannah's playground\nHey, this is one of the first maps I've done and I know it there are bugs in it and it looks unfinished but I thought I'm going to upload ist anyway! Don't expect a great map like \"Obstacle Course 1\" by French Frie or \"Speed Race Map\" by igresix. It's more like \"test map\"\nMy map's name \"hannah's playground\" was inspired by \"TimsPlayground.upk\" because it's neither a training map nor a racing map nor an arena.\nDescription: Platforms floating in the middle of nowhere. Some rings you can fly trough. A lot of flying is required to play this map. A lot of bugs are in this map. A lot of flying is required to play this map.\nSpecial thanks to /u/whynotsteven who created the subreddit /r/RocketLeagueMods and made many usefull tools such as the RL Map Loader which made loading maps way faster.\nAnd /u/ButterandCream0 who provided us helpfull guides for getting started with \"Rocket-League-modding\" and organizing all the information.\nAlso special thanks to /u/EpicEclipse who makes videos about Rocket League maps and was the first one to make me aware of custom Rl maps. He also made a weekly series about new maps which I really enjoyed.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=816596334"}, "stanswaggermaparrr2.udk": {"title": "ShipYarrr V7.3.1 (10 Year SARPBC)", "author": "Stanbroek", "description": "**Ahoy matey are you ready to score the seven goals,well then you have come to the right place !!1!**\n- Upgraded textures.\n- A custom scoreboard in workshop.\n- Bot support in workshop.\n- Multiplayer compatible.\n- For more updates check the \nchange log: <http://steamcommunity.com/sharedfiles/filedetails/changelog/817314448>\nWith the \nColiseum: <https://poly.google.com/view/4raJTBfhAfc>\n[poly.google.com]\n model and \nBalloons: <https://poly.google.com/view/8kBCtHphxJU>\n[poly.google.com]\n model from Poly by Google and Ian MacGillivray respectively.\n**[How to multiplayer?]**\n<https://bakkesplugins.com/plugins/view/26>\n**[Looking for the Christmas edition?]**\n<https://rocketleaguemods.com/mods/shipyarrr-christmas-edition/>\nPs. did you find all the secrets?", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=817314448"}, "stadiumsarpbc.udk": {"title": "Stadium (SARPBC)", "author": "South", "description": "Stadium, ported from Supersonic Acrobatic Rocket-Powered Battle-Cars!\nRead instructions and download textures here: \n<https://rocketleaguemods.com/mods/all-textures-sticky-walls-for-stadium-sarpbc/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=817879031"}, "rl_skatepark.udk": {"title": "Octopark v1.21 (Skatepark)", "author": "FourFour", "description": "For those of you that were having issues after Rocket League updated to version 1.31 (Dropshot update), the 1.32 hotfix appears to have resolved them!\nNow with new giant halfpipe area! \nCheck out the videos above for a quick look at some of the features of the skatepark.\nTo play the map simply press \"Subscribe\", launch Rocket League, and go to Extras > Workshop. \nI think it is unlikely I will make further updates at this point, but I'm sure someone much more talented than me will come along soon and make a more polished/feature rich skatepark for everyone still wanting one!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=818027301"}, "mayan.udk": {"title": "[MultiPlayer] MayanPitz v0.1", "author": "[GoogleMe]NoodleMixingSounds", "description": "Inspired by the classic Meso-American Ball Game, Pitz.  \nIf you want a more casual experience, enable rumble mutator 'spikes only'.\nNOTES: \n-WILL crash your game in training mode if you score in the blue goal.  Will be fixed in v0.2\n-Training Mode sometimes spawns the player outside of the map; just reload to try for a better spawn.\n-To play with bots, use RL Map Loader and play in Exhibition Mode with 'Disable Goal Reset' mutator.  \n<https://www.reddit.com/r/RocketLeagueMods/comments/4tcvqg/rl_map_loader_03/>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=818046681"}, "Lobby_parcour_v1.udk": {"title": "Parkour-Map", "author": "Dreale", "description": "Finally finished - 20 Parcours and I'm happy with it ;) \nIt was my first Playground to try ideas for Parcours in Rocket league and it's gotten quite challenging... \nMap was tested and played on Lachinio-Settings, with Camera-distance greater then 250 you get a lot of bugged camera and problems. \nFor Textures go to \n<https://rocketleaguemods.com/mods/textures-for-maps/>\n \nand follow the instructions.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=821751580"}, "Cheese.udk": {"title": "Get the Cheese!", "author": "Dreale", "description": "Get the Cheese! \nEZ-Mode: 60 Sec +7 Sec for every Cheese \nNM-Mode:30 Sec+5 Sec for every Cheese \nHC-Mode: 15 Sec+3 Sec for every Cheese \nFor Textures go to \n<https://rocketleaguemods.com/mods/textures-for-maps/>\n \nand follow the instructions.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=823070494"}, "Floating.udk": {"title": "Aerial Rotation Practice", "author": "Skrat", "description": "As requested by gs89 and Nubbacus ( a long time ago ) on reddit, a map to pracitce the cars aerial behaviour.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=823319029"}, "testmapRL.udk": {"title": "TestMap2", "author": "PotatoOS", "description": "mk its a fix test", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=826186114"}, "Redpike_ar.udk": {"title": "RedPikeArena", "author": "MCB | Liquid MuggedByaCoffeBean", "description": "SMALL UPDATE!\nThanks to the devs in releasing un update to fix spawn points in custom maps. You will also find on this map that you will no fall through the floor when you turtle along the ground.\nThis is my attempted recreation of \"Red Pike Arena\" from \"Destruction Derby 2\". This map still is a work in progress, so at some point I will add textures, fix any bugs and add more things to it. I should note that there are a few bugs such as: when landing on the outer part of the arena upside down or on certain angles will cause the car to get stuck inside the model. Also, if you fall out the map you will not automatically respawn so you will need to press backspace when you die.\nI almost forgot to mention that all of this has been modeled in blender.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=828724949"}, "ObstacleChallenge2.udk": {"title": "Obstacle Course #2 v1.1", "author": "French Fries", "description": "Fixed a wall that doesn't reset you in level 28 and a texture in level 30\nFrench Fries presents the second map in the obstacle course series. \nIf any textures appear black make sure to download and follow the instructions from \n<https://rocketleaguemods.com/mods/textures-for-maps-and-sticky-walls/>\n \nIf you are interested follow me on twitter ( \n<https://twitter.com/FrenchFriesRL>\n ) \nor twitch ( \n<https://www.twitch.tv/frenchfriesrl>\n ) \nApologies about camera angles, good luck! (my best time is 9:05)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=828803580"}, "Obstacle2.udk": {"title": "Parkour-Map #2 : It's moving!", "author": "Dreale", "description": "Just an short parkour-Map in which i played around with a lot of different Moving obstacles...Good luck and have fun!\nGive me Feedback on which levels you liked and disliked and why to influence future Maps ;) \nMap was tested and played on Lachinio-Settings, with Camera-distance greater then 250 you get a lot of bugged camera and problems. \nFor Textures go to \n<https://rocketleaguemods.com/mods/textures-for-maps/>\n \nand follow the instructions.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=844375200"}, "DanceStudioLevel.udk": {"title": "DanceStudio", "author": "Skrat", "description": "You can practice your post-game-celebration on this map", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=848736100"}, "rl_toilets.udk": {"title": "The Game of Throne", "author": "Baoulettes", "description": "Still have several frame drops !", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=858203319"}, "downhill.udk": {"title": "My playground", "author": "CoCo", "description": "This is more of my test map but I guess people can have fun on it :D", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=860554581"}, "rocket_league_village.udk": {"title": "Rocket League Village - By CoCo", "author": "CoCo", "description": "The Rocket League village itself !\n**/!\\ Important - read before playing /!\\**\nMake sure to download \nthis file: <https://www.dropbox.com/s/odbl1sh6a8p87iz/rocket_league_village_textures.zip?dl=0>\n[www.dropbox.com]\nand to add the content of the .zip file into the following folder \"..\\Steam\\steamapps\\common\\rocketleague\\TAGame\\CookedPCConsole\", so you can enjoy all the map textures !\nIf you get stuck into a house, restart the map to get a better spawn. Sorry about this, might patch it.\nHope you enjoy !\nCoCo", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=863543973"}, "NeoInTraining.udk": {"title": "NeoTokyo In Training!", "author": "South", "description": "Finally, you can play NeoTokyo in training!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=863615944"}, "WastelandInTraining.udk": {"title": "Wasteland In Training!", "author": "South", "description": "Finally, you can play Wasteland in training!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=863625951"}, "ARCInTraining.udk": {"title": "Starbase ARC In Training!", "author": "South", "description": "You can now play Starbase ARC in training!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=863634182"}, "Dark2.udk": {"title": "Parkour-Map #3 : Into the Dark!", "author": "Dreale", "description": "Just an short Parkour-Map in which i played around with lights...Good luck and have fun!\nGive me Feedback on which levels you liked and disliked and why to influence future Maps ;) \nMap was tested and played on Lachinio-Settings, with Camera-distance greater then 250 you get a lot of bugged camera and problems. \nFor Textures go to \n<https://rocketleaguemods.com/mods/textures-for-maps/>\n \nand follow the instructions.", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=864070919"}, "RaiseTheRoof_v2.udk": {"title": "RaiseTheRoof v2", "author": "Mr. Swaggles", "description": "A default map that's 10x as tall. No more pesky ceiling to get in the way of your beautiful air dribbles!", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=865518553"}, "RL_Test9.udk": {"title": "GCTesting", "author": "Giarc007", "description": "Testing - Large round map", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=868036013"}, "test_Volleyball (1).udk": {"title": "Volley Ball Map", "author": "TheSchwa", "description": "Hey, just to make it clear, I didn't create this map. This was made by Psyonix as a test map a while back. Just thought some of you might want to check it out. I know its not playable.\n(THIS MAP DOES NOT WORK ANYMORE!)", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=873282461"}, "testestset.udk": {"title": "eresrsdf", "author": "Yoda Gonzales", "description": "esfdgrers", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=876018192"}, "BeachVolley.udk": {"title": "[2-8 Players] Beach Volley", "author": "Derzo", "description": "The one and only actual volleyball game mode in Rocket League\n*They should hire the person who made this, would be their first useful employee*\n -Woofless\nHow to play with friends!\n1. \nDownload Rocket Launcher: <https://www.reddit.com/r/RocketLeague/comments/7462cv/announcing_rocket_launcher_a_program_for_playing/>\n2. \nDownload and register to evolve 1.0: <https://www.evolvehq.com/welcome>\n[www.evolvehq.com]\n It's a bit easier than hamachi and direct IP connection IMO\n3. Create an evolve party and let your friends join it\n4.  \nDo this fix for evolve: <https://www.youtube.com/watch?v=V7il4PB2yuk>\n5. (Optional) Go to Evolve Preferences by clicking the big button on top left corner, go to features and disable everything else than Party System. Evolve can be pretty annoying if you don't do that\n6. Launch Rocket League\n7. Launch Rocket Launcher\n8. Go to Map Swapper tab in Rocket Launcher, hit Refresh and select BeachVolley (everyone has to do this)\n9. Host a local lobby with the map set to underpass (Labs, not tokyo) and let your friends join that local lobby\nAlso note that if the host has downloaded any texture packages, everyone joining has to have them too. Otherwise you're going to get a package mismatch error when joining.\nRecommended Mutators\nBoost Amount: Unlimited", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=916532343"}, "test_Volleyball.udk": {"title": "Volleyball Map (Not working now)", "author": "Forionis", "description": "It is a secret map of the game. And you don't need to search on Internet hours and hours. Nevermind just enjoy it!\nIn 2015 and 2016 this map was hidden in the Rocket League files. When I found it I want to share with the other players. In the first time people generally loved it and it makes me happy ofc. But the map is always crashing the game about 2 years. And It means Pysonix is ban the map. I mean like this map is now disabled for permanent.\nSorry about crash reports.\n \n           Wish you guys getting the rank 1 in RL Ranked. Cya\n2019-05-09\nyyyy-dd-mm", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=926490096"}, "DribblingChallenge2.udk": {"title": "Dribbling Challenge #2", "author": "French Fries", "description": "French Fries presents the second map in the Dribbling Challenge Series. \nIf any textures appear black make sure to download and follow the instructions from \n<https://rocketleaguemods.com/mods/workshop-textures/>\nCheck out the current speedrunning records at \n<http://wiki.teamliquid.net/rocketleague/Speedruns>\nIf you are interested follow me on twitter ( \n<https://twitter.com/FrenchFriesRL>\n ) \nor twitch ( \n<https://www.twitch.tv/frenchfriesrl>\n ) \nDonations are by no means necessary however this map probably took about 100 hours to make and anything spared would help encourage me to make more. \nIf you do want to help me out you can at \n<https://streamlabs.com/frenchfriesrl>", "source": "https://steamcommunity.com/sharedfiles/filedetails/?id=964271505"}, "LethAirDribbleArena.udk": {"title": "Air Dribble Arena", "author": "Lethamyr", "description": "Air dribble from the ramp in the middle to the elevated goals!"}, "LethAirHockey.udk": {"title": "Air Hockey Table", "author": "Lethamyr", "description": "A giant air hockey table with goals at the back of the field."}, "LethBasketball.udk": {"title": "Basketball Court", "author": "Lethamyr", "description": "Rocket League Hoops... for real this time?"}, "LethBattlegrounds.udk": {"title": "Battlegrounds", "author": "Lethamyr", "description": "7 rooms with 2 goals at each end. Extremely fun!"}, "LethBeerPong.udk": {"title": "Beer Pong", "author": "Lethamyr", "description": "A giant version of Beer Pong in Rocket League."}, "LethBlockFort.udk": {"title": "Block Fort", "author": "Lethamyr", "description": "A re-creation of Block Fort from Mario Kart 64 inside Rocket League."}, "LethBoardwalk.udk": {"title": "Boardwalk", "author": "Lethamyr", "description": "Elevated goals with a boardwalk connecting them!"}, "LethBouncyCastle.udk": {"title": "Bouncy Castle", "author": "Lethamyr", "description": "Rocket League in a bouncy castle! 4 Goals in each quadrant."}, "LethBreakTheBank.udk": {"title": "Break the Bank", "author": "Lethamyr", "description": "Gather points through the rings, secure the points by bringing the ball back to your own color."}, "LethShipment.udk": {"title": "Call of Duty Shipment", "author": "Lethamyr", "description": "A remake of one of the classic smallest deathmatch maps in CoD"}, "LethCaptureTheFlag.udk": {"title": "Capture The Flag", "author": "Lethamyr", "description": "Capture the flag! Bring both flags to your zone to win!"}, "LethCargo.udk": {"title": "Cargo Bay", "author": "Lethamyr", "description": "A standard map but only the cars have zero gravity!"}, "LethCornhole.udk": {"title": "Cornhole", "author": "Lethamyr", "description": "Throw bean bags on the board to score points!"}, "LethCrossroads.udk": {"title": "Crossroads", "author": "Lethamyr", "description": "4 nets in a cross pattern!"}, "LethDoubleSize.udk": {"title": "Double-Size", "author": "Lethamyr", "description": "Rocket League, but it's double the size!"}, "LethDribbleChallenge1.udk": {"title": "Dribbling Challenge 1", "author": "Lethamyr", "description": "An extremely unforgiving and challenging dribble run."}, "LethCatwalk.udk": {"title": "Easter Catwalk", "author": "Lethamyr", "description": "A map celebrating Easter! A catwalk with goals between the bridge."}, "LethFlashFreeze.udk": {"title": "Flash Freeze", "author": "Lethamyr", "description": "The ball randomly freezes in place!"}, "LethFoosballV2.udk": {"title": "Foosball Table - Remastered", "author": "Lethamyr", "description": "A remastered version of the original Giant Foosball Table Map"}, "LethGrandHall.udk": {"title": "Grand Hall", "author": "Lethamyr", "description": "A freestyler's paradise. A circular non-standard map!"}, "LethGraverobber.udk": {"title": "Graverobber", "author": "Lethamyr", "description": "Score in the net to open the goals in the floor!"}, "LethDungeonHeliumBall.udk": {"title": "Helium Ball", "author": "Lethamyr", "description": "A standard map, but only the ball has zero gravity"}, "LethIceRings.udk": {"title": "Ice Rings", "author": "Lethamyr", "description": "Train your aerial car control in this MASSIVE rings map. Can you solve the hidden easter egg?"}, "LethLuigisMansion.udk": {"title": "Luigi's Mansion", "author": "Lethamyr", "description": "Luigi's Mansion re-created inside Rocket League!"}, "LethOriginalSumo.udk": {"title": "Original Sumo", "author": "Lethamyr", "description": "The first sumo map, a simple circular platform. Don't get bumped off!"}, "LethPinball.udk": {"title": "Pinball Table", "author": "Lethamyr", "description": "A giant pinball table. Control the paddles and get the high score!"}, "LethPingPong.udk": {"title": "Ping Pong Table", "author": "Lethamyr", "description": "Goals are on the outer portions of the ping pong table!"}, "LethPoolTable.udk": {"title": "Pool Table", "author": "Lethamyr", "description": "Currently broken, but feel free to explore the map!"}, "LethPopshot.udk": {"title": "Popshot", "author": "Lethamyr", "description": "Dropshot tiles on the ceiling!"}, "LethPortal.udk": {"title": "Portal", "author": "Lethamyr", "description": "Bringing Portal 2 to life in Rocket League with working portals!"}, "LethProphunt1.udk": {"title": "Prop Hunt - Castle", "author": "Lethamyr", "description": "Hide as a prop and try not to get caught!"}, "LethProphunt1V2.udk": {"title": "Prop Hunt - Castle Remastered", "author": "Lethamyr", "description": "A remastered version of Prop Hunt - Castle (cleaner textures and lighting)"}, "LethRainbowRoad64.udk": {"title": "Rainbow Road 64", "author": "Lethamyr", "description": "Mario Kart 64's Rainbow Road Race in Rocket League!"}, "LethSlingPuck.udk": {"title": "Sling Puck", "author": "Lethamyr", "description": "Get all 10 pucks to the other side to win!"}, "LethSpaceSeeker.udk": {"title": "Space Seeker", "author": "Lethamyr", "description": "Heatseeker in Space! Zero gravity with floating goals"}, "LethSumoCage.udk": {"title": "Sumo Cagematch", "author": "Lethamyr", "description": "Demo each other out of the cage! Be the last one standing to win!"}, "LethToronto.udk": {"title": "Toronto Track", "author": "Lethamyr", "description": "A downtown Toronto Race with crates and boost pads!"}, "LethTripleGoal.udk": {"title": "Triple Goal", "author": "Lethamyr", "description": "3 goals on each side of the field."}, "LethUnderwaterGoals.udk": {"title": "Underwater Goals", "author": "Lethamyr", "description": "A very difficult map. Goals are underwater in the center of the map!"}, "LethWaveRace.udk": {"title": "Wave Race", "author": "Lethamyr", "description": "Race through a watery tunnel on a jetski!"}}